{"id":4992,"date":"2019-06-25T15:06:30","date_gmt":"2019-06-25T15:06:30","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?page_id=4992"},"modified":"2020-02-21T16:12:42","modified_gmt":"2020-02-21T22:12:42","slug":"privacy","status":"publish","type":"page","link":"https:\/\/www.growwithstudio.com\/privacy","title":{"rendered":"Privacy"},"content":{"rendered":"\n<h2>Privacy Policy<\/h2>\n<p>This page explains our terms of service, which contains important information about your legal rights. When you work with Studio, a sub-brand of Volusion LLC, you&#8217;re agreeing to these terms. Everyday language summaries are provided for your convenience only and are not legally binding.<\/p>\n<p>All terms not otherwise defined herein shall have the definitions set forth in the <a href=\"https:\/\/www.growwithstudio.com\/terms\">Terms of Service<\/a>. <br><\/p>\n<p>This privacy policy (this &#8220;Privacy Policy&#8221;) is effective as of the date set forth above. Studio, a sub-brand of Volusion, LLC is committed to honoring the privacy of Our customers and visitors (&#8220;You&#8221; or &#8220;Your&#8221;). This Privacy Policy, which is part of Our overall Terms of Service (&#8220;Terms of Service&#8221;), covers personal information shared through Our website and Our Services, including Personally Identifiable Information and Anonymous Information (the &#8220;Personal Information&#8221;). &#8220;Personally Identifiable Information&#8221; or &#8220;PII&#8221; means information that can be used to identify You as an individual, such as, for example:<\/p>\n<ul><li>Your name, company, email address, phone number, billing address, and shipping address;<\/li><li>Your CRM website platform and password (if applicable);<\/li><li>credit card information (if applicable);<\/li><li>Social platform logins (if applicable);<\/li><li>Advertising platform logins (if applicable);<\/li><li>any account-preference information You provide us; and<\/li><li>Your computer&#8217;s IP address.<\/li><\/ul>\n<p>&#8220;Anonymous Information&#8221; means information and data that is not linked to Your Personally Identifiable Information and does not, by itself, permit the identification of an individual.<\/p>\n<p>This Privacy Policy describes how We collect and use the Personal Information You provide on Our website (“Our Site”) and as part of Our Services. It also describes the choices available to You regarding Our use of Your Personal Information and how you can access and update this information. Unless otherwise specifically required by applicable law, by submitting Personal Information through Our Site or as otherwise described in this Privacy Policy, or, even if You are not a customer, by visiting Our Site, You expressly consent to the collection, use and disclosure of Your Personal Information in accordance with this Privacy Policy.<\/p>\n<p>We collect basic client information, including Personal Information, in connection with the performance of the Services. We respect Your privacy, and We assure you that We will maintain and use this information responsibly.<\/p>\n<p>We do not intentionally gather Personal Information from visitors who are under the age of 13.<\/p>\n<p>Please note that this Privacy Policy only addresses activities on Our Site and Our servers, and does not govern the collection and use of information by Our merchants, Our partners, or other companies that We do not control, nor by individuals not employed or managed by Us. If You visit a website that We host, mention or link to, another entity may collect Your Personal Information and You should review its privacy policy before providing the site with information.<br><\/p>\n<p><strong>Data We Collect from You<\/strong><\/p>\n<p>Account Registration<\/p>\n<p>The registration of an Account requires You to provide certain Personal Information, including a full legal name, current address, phone number, a valid email address and certain other information indicated as required. If You choose Services that require the payment of a fee, You will also be required to submit a credit card\/debit card number, expiration date and billing zip code, which information will be kept on file in Our secure servers in order to process Your recurring invoices. In connection with Your account registration, We may also ask for additional information, including the number of employees in Your company (if an entity), Your annual revenues, Your industry and other similar information. We use all such information to provide the Services to You, including to contact You, confirm Your identity and, if applicable, to invoice You.<br><\/p>\n<p>Our Partners<\/p>\n<p>We collect Personal Information from our partners, which include individuals and businesses that have entered into a partnership agreement with Us. Our partners can include referral partners, developers, technology partners and solution partners. We also collect Personal Information about Your customers from Our partners in accordance with their applicable privacy policy. We use all such information to provide the Services to You, including to contact You and confirm Your identity and to improve the Services so that You can better serve Your customers.<br><\/p>\n<p>General Browsing<\/p>\n<p>Whether You are a customer of Ours or not, We collect Anonymous Data, including data about Our websites that You visit and how You browse, information about the device, operating system and browser You use, Your network connection, Your IP address and the date\/time stamp for Your visit. If You are a customer of Ours, We will also collect data about how and when You access Your Account. We use this information to see which areas are most visited, which helps Us improve the quality of visitors&#8217; online shopping experiences by recognizing and delivering more of the features, services and products that Our visitors prefer. We may also use this information to provide You advertising or marketing.<\/p>\n<p>Social Media<\/p>\n<p>Our websites may use social media features, such as the Facebook &#8216;like&#8217; button (&#8220;Social Media Features&#8221;). These features may collect Your IP address and which page You are visiting on Our website, and may set a cookie to enable the feature to function properly. You may be given the option by such Social Media Features to post information about Your activities on Our website to a profile page of Yours that is provided by a third party social media network in order to share with others within your network. Social Media Features are either hosted by a third party or hosted directly on Our website. Your interactions with these features are governed by the privacy policy of the company providing the relevant Social Media Features.<br><\/p>\n<p>Contests and Sweepstakes<\/p>\n<p>With respect to persons age 13 or older, We collect Personal Information required to participate in certain contests, sweepstakes, and\/or other giveaways (individually and collectively, &#8220;Promotions&#8221;) that We conduct on social media\/networking websites including, but not limited to twitter.com, facebook.com, pinterest.com, instragram.com, and youtube.com (each, a &#8220;Social Media Site&#8221;), or on Our website. This information may vary but will typically include your first and last name, mailing address (including city, state, zip code and country) and e-mail address. It may also include additional information, such as telephone number, fax number, and information about your interests in and use of various products, programs and services. We will use any such Personal Information to contact You regarding Your interest in, or experience with, the Services, as well as for marketing purposes.<br><\/p>\n<p>Other<\/p>\n<p>From telephone users, We collect your phone number and call audio. From chat support users, we collect PII as well as information about the device and browser You use, Your network connection and Your IP address. From forum users, we collect certain PII, including Your name, email address and website URL. We use all of this information to provide to You the Services, to enhance Our Services and answer any questions You may have.<\/p>\n<p><strong>Use of Personal Information<\/strong><\/p>\n<p>Our Use<\/p>\n<p>As described above, We will use Personal Information to perform the Services, including to facilitate the creation of and secure Your account on our network and identify You as a user in Our system. We will also use Personal Information to contact You regarding Your interest in, or experience with, the Services, to provide You with support and to improve the quality of Our Site and Services. We may also use Personal Information for marketing purposes. For example, We may use information that You provide to contact You or send to You information regarding Us or our partners. We use Personal Information that You provide to Us or that is collected from partners to conduct automated decision making, including to assist us in screening merchant accounts for risk or fraud concerns.<br><\/p>\n<p>We will not use or disclose any such PII, except:<\/p>\n<ul><li>as necessary to provide the Services to You;<\/li><li>in the aggregate with other information in such a way so that Your identity cannot reasonably be determined (for example, statistical compilations);<\/li><li>as required by law, or based on our good faith belief that it is necessary to conform or comply with the law;<\/li><li>to outside auditors who have agreed to keep the information confidential;<\/li><li>to a successor organization in the event of a merger, acquisition, bankruptcy, or other sale or disposition of all or a portion of Our assets;<\/li><li>as necessary to enforce Our Terms of Service;<\/li><li>as necessary to protect Our rights, safety, or property, Our users, or others; this may include (for example) exchanging information with other organizations for fraud protection and\/or risk reduction; and<\/li><li>as otherwise described in this Privacy Policy or to which You have consented.<\/li><\/ul>\n<p>We do not sell, rent or trade Your Personal Information to third parties. We will not use any PII we collect from You or Your customers to contact or market to Your customers or directly compete with You.<\/p>\n<p>Third Parties<\/p>\n<p>If You purchase, use or specifically express interest in a product or service of one of Our partners, We may share Personal Information about You with such partner.<\/p>\n<p>We use third party payment processors to assist Us in processing and share with them Your PII payment information securely. Such third party processors’ use of Your Personal Information is governed by their respective privacy policies which may or may not contain privacy protections as protective as this privacy policy.<\/p>\n<p>We may use other third parties to help Us provide services and marketing to You, such as shipping or fulfilling orders, processing payments, monitoring site activity, identifying and preventing fraud, conducting quality assurance and testing, providing support, conducting surveys, and administering e-mails, and share with them Your Personal Information solely for those purposes.<\/p>\n<p>If We share any Personal Information with any of these third parties, We will require that such information be used only to provide the services requested by Us and be maintained by them in strictest confidence.<\/p>\n<p>We do not control the use by third parties of Your Personal Information that We collect, and its use by them will be in accordance with their own privacy policies. However, We will ensure that they are bound by agreements with us that include non-disclosure and certain data protection provisions. If you do not wish for Your Personal Information to be shared in this manner, You may opt not to purchase or use these third party services or to specifically express interest in Our partners products or services.<\/p>\n<p>We will always ask for Your consent before sharing Your Personal Information with Third Parties for purposes other than those described herein.<br><\/p>\n<p><strong>Cookies<\/strong><\/p>\n<p>A cookie is a small amount of data or pieces of text, which may include a unique identifier, and is typically sent to and stored on Your browser or device. Cookies are generally by websites to improve the browsing experience of a user. They typically enable websites to remember preferences and understand how people navigate or use a website, and can be used to provide a user with more relevant marketing and advertising.<br><\/p>\n<p>A list of the cookies that may be placed in Your browser or device as a result of a visit to Our Site, or any of our customer’s sites, may be found <a href=\"https:\/\/helpcenter.volusion.com\/run-your-business\/volusion-cookies\">here<\/a>.<\/p>\n<p>Our Services<\/p>\n<p>We use cookies to provide a better experience for Our users by allowing Us to analyze how the Services are being accessed and used. For example, cookies enable Us to recognize Your device and make Our sites more responsive to Your needs by delivering a better and more personalized experience to You. In addition, cookies are used by Us to help track your clicks as you go through the pages within any of Our websites, which allows Us to track performance and improve Our Site and Services.<\/p>\n<p>We also use cookies to help Us verify Your Account and device for authentication purposes and to determine when You are logged in. This enables You to avoid re-entering information upon every new visit to Our Site and to help prevent fraudulent use of credentials.<br><\/p>\n<p>Similarly, We use cookies to enhance Our Services for Our customers. For example, We use cookies in connection with the operation of the shopping cart for Your Site to authenticate Your customers, provide Your customers with a personalized experience by remembering their preferences and to help keep track of support requests.<\/p>\n<p>Third Parties<\/p>\n<p>Third parties that have content embedded on Our Site such as a social feature may set cookies on a user’s browser and\/or obtain information about the fact that a web browser visited a specific website from a certain IP address. Third parties cannot collect any other personally identifiable information from Our websites unless You provide it to them directly. Any third party cookie usage is governed by the policy of the third party placing the cookie.<\/p>\n<p>Our Advertising<\/p>\n<p>We partner with third party publishers, advertisers and other service providers to manage Our ads on other websites. These third parties may send cookies to Your browser or device to gather information about Your activities on Our Site and other sites that You visit. This information is then used to manage Our ads. For example, if You visit Our Site, You may see a Volusion ad when You visit another website or use a social media platform.<br><\/p>\n<p>Third Party Tags<\/p>\n<p>We use and manage third party tags on Our Site. Third party tags may take the form of pixels or tracking snippets. This means that no cookies are used and no personal data is collected. We use Google Tag Manager to manage our third party tag usage. We use tracking snippets to capture data from your browser, make requests to a third party partner or set cookies on your device to store data. This may cause other tags to be activated which may, for their part, collect data and set cookies under certain circumstances. <a href=\"http:\/\/www.google.com\/analytics\/tag-manager\/use-policy\/\">Google Tag Manager<\/a> does not access or store this data.<\/p>\n<p>Tracking<\/p>\n<p>We may also use web beacons, tracking technology and other automated tracking methods on Our Site, in mobile applications and communications with You and in Our products and services, to track and measure performance and engagement on Our Site and Services and Our ads.<br><\/p>\n<p>Opting Out<\/p>\n<p>If You prefer not to accept cookies, You can set Your browser to either completely disallow cookies or have a browser alert You when a site is using a cookie. The exact method of disabling cookies varies depending on the browser You are using; please consult the Help option in Your browser for specific directions. Please note that if You reject or block all cookies in Your browser settings, You will not be able to take full advantage of Our services as some cookies are necessary for the site to function properly.<\/p>\n<p>We have implemented and use Display Advertising to allow for Google Analytics Remarketing. You can opt-out of Google Analytics for Display Advertising and customize Google Display Network ads using <a href=\"http:\/\/www.google.com\/settings\/ads\">Google Ads Settings<\/a> can also use the <a href=\"https:\/\/tools.google.com\/dlpage\/gaoptout\">Google Analytics opt-out browser plug-in<\/a> to prevent their data from being collected and used by Google Analytics.<\/p>\n<p>You can opt out of targeted ads served via specific third party vendors by visiting the Digital Advertising Alliance’s <a href=\"http:\/\/optout.aboutads.info\/\">Opt-Out page<\/a> and the Network Advertising Initiative’s <a href=\"http:\/\/optout.networkadvertising.org\/\">Opt-Out page<\/a>. If You are a resident of the European Union, please see <a href=\"https:\/\/www.youronlinechoices.eu\/\">here<\/a>.<\/p>\n<p>You may deactivate Google Tag Manager with the help of a browser add-on if you do not want this website analysis. One such add-on can be downloaded at: <a href=\"http:\/\/www.ghostery.com\/\">www.ghostery.com\/<\/a><br><\/p>\n<p>There is no industry standard or understanding about how to respond to “Do Not Track” (“DNT”) signals. Therefore, unless otherwise required by law, We do not alter our data collection and usage practices when We detect DNT signals from Your browser.<br><\/p>\n<p><strong>Third Party Apps<\/strong><\/p>\n<p>Our Services allow You to connect Your stores with third party applications to alter or provide new functionalities or add services. We are not responsible for and have no control over how these applications collect, use or share Your Personal Information. Use of these third party applications is not subject to Our Privacy Policy and their use will be in accordance with their own privacy policies.<br><\/p>\n<p><strong>Use of Forums \/ Discussion Boards<\/strong><\/p>\n<p>None of the information contained on Our website is medical, legal, business, or other advice or opinion. Any opinion expressed via this service is that of its author. Users are reminded that postings are automatic, instantaneous, and are not pre-reviewed. Additional facts and information on legal or other developments may affect the subjects discussed. Confidential information should not be discussed. We assume no responsibility for the content or consequences, direct or indirect, of communications by users.<\/p>\n<p><strong>Security<\/strong><\/p>\n<p>If You provide to Us, or We otherwise collect, Personal Information, either directly or through a partner, We will take commercially reasonable precautions to protect the information from loss, misuse and unauthorized access, disclosure, alteration and destruction. We follow industry standards on information security management to safeguard sensitive information, and are certified as a PCI-DSS service provider. Our platform is audited annually by a third-party qualified security assessor for compliance with PCI-DSS.<br><\/p>\n<p><strong>Retention<\/strong><\/p>\n<p>We will retain Your Personal Information for as long as Your Account is active or for as long as needed to provide You or our users with the Services. We also retain Your Personal Information for legitimate business purposes and to comply with the law. The precise periods for which We retain Your Personal Information vary depending on the nature of the information or why We need it.<\/p>\n<p>We collect and retain indefinitely anonymous or anonymized information, such as website visits, in order to improve our Services.<br><\/p>\n<p><strong>Residents of the European Economic Area<\/strong><\/p>\n<p>Our operations are located primarily in the United States. If You are located in the European Economic Area (the “EEA”), Your Personal Information will be transferred out of the EEA to the United States. Residents of the EEA have certain rights under European law with respect to Your personal data, including the right to request access to, correct, amend, delete or limit the use of Your personal data. If You are a resident of the EEA and Our customer or partner or a User of Our Site and You wish to exercise these rights, please contact us by emailing privacy@volusion.com.<\/p>\n<p>For customers of stores that We host on behalf of Our customers in connection with Our Services, We serve as a processor on Our customers’ behalf. As such, if You wish to exercise these rights, please contact Our customer directly.<\/p>\n<p>If You are a resident of the EEA, We note that We are generally processing Your information in order to fulfill our obligations under contracts We have with You (including our <a href=\"https:\/\/www.volusion.com\/terms-of-service\">Terms of Service<\/a>), or otherwise to pursue our legitimate business interests as described in this Privacy Policy, unless We are required by law to obtain Your consent for a particular processing operation.<br><\/p>\n<p><strong>Privacy Shield<\/strong><\/p>\n<p>Our operations are located primarily in the United States. If You provide information to us, the information will be transferred out of the European Union (“EU”) and Switzerland to the United States. We comply with the EU-U.S. Privacy Shield Framework as set forth by the U.S. Department of Commerce (the “Privacy Shield”) regarding the collection, use and retention of personal information transferred from the EU to the United States (“EU Personal Data”). We have certified to the Department of Commerce that we adhere to the Privacy Shield Principles. To learn more about the Privacy Shield program, and to view our certification, please visit <a href=\"http:\/\/www.privacyshield.gov\/\">http:\/\/www.privacyshield.gov<\/a>.<\/p>\n<p>The Privacy Shield Principles set forth Our accountability for EU Personal Data that We receive under the Privacy Shield and subsequently transfer to a third party. As described in this Privacy Policy, We may use third parties to process data on our behalf. We remain liable if they do so in a manner inconsistent with the Privacy Shield Principles and We are responsible for the event giving rise to the damage.<\/p>\n<p>We encourage You to contact Us should you have a Privacy Shield-related complaint. We will respond within 45 days. If We fail to respond within that time, or if Our response does not address Your concern, You may contact the International Centre for Dispute Resolution, the International division of the American Arbitration Association. Please visit <a href=\"http:\/\/go.adr.org\/privacyshield.html\">http:\/\/go.adr.org\/privacyshield.html<\/a> for additional information and to file a complaint. Under certain conditions, more fully described on the Privacy Shield <a href=\"https:\/\/www.privacyshield.gov\/article?id=How-to-Submit-a-Complaint\">website<\/a>, You may be entitled to invoke binding arbitration when other dispute resolution procedures have been exhausted.<\/p>\n<p>We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission.<\/p>\n<p>We may be required to disclose personal information in response to lawful requests by public authorities, including to meet the national security or law enforcement requirements.<br><\/p>\n<p><strong>Choices Regarding Your Personal Information<\/strong><\/p>\n<p>We understand that and value Your rights over Your Personal Information. We have taken steps to allow You to access, correct, amend, delete or port Your Personal Information and give You choices regarding the collection, use and sharing of Your Personal Information. You may manage your receipt of marketing and non-transactional communications by clicking on the “unsubscribe” link located on the bottom of Our marketing emails. If You are Our customer or a partner, You can update many types of Personal Information directly within Your Account settings. If You are unable to change Your Personal Information within Your Account settings, or if You are concerned about data collected as You visit Our Site, please contact us at privacy@volusion.com. If You are a customer of Our customers and wish to exercise these rights with respect to their sites hosted by Us, please contact Our customer directly. Please understand that if You delete or limit the use of Your Personal Information, the Services may not function properly or certain Services may not be available.<br><\/p>\n<p><strong>Prior Versions<\/strong><\/p>\n<p>If you have questions or concerns with respect to our Privacy Policy, please feel free to contact us at privacy@volusion.com. If elements of our Privacy Policy change, We will post the updated Privacy Policy on this website. If You are concerned about how your Personal Information is used, please visit Our site often for this and other important announcements about Volusion.<\/p>\n<p>We believe in providing a safe and secure shopping experience for all of our clients. We provide stringent and effective security measures on our website. It is our policy to never send private information, such as your credit card number, via e-mail, IM, chat or other unsecured means. In fact, this is a practice We recommend you adopt in all of Your Internet activities.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Privacy Policy This page explains our terms of service, which contains important information about your legal rights. When you work with Studio,&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page_no_sidebar.php","meta":[],"folder":[235],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy - Grow With Studio<\/title>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/privacy\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Privacy Policy This page explains our terms of service, which contains important information about your legal rights. When you work with Studio,...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/privacy\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:modified_time\" content=\"2020-02-21T22:12:42+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/04\/studio_icon-e1557248001420.png\" \/>\n\t<meta property=\"og:image:width\" content=\"72\" \/>\n\t<meta property=\"og:image:height\" content=\"55\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"19 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/privacy#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/privacy\",\"name\":\"Privacy - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"datePublished\":\"2019-06-25T15:06:30+00:00\",\"dateModified\":\"2020-02-21T22:12:42+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/privacy#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/privacy\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/privacy#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/privacy\",\"url\":\"https:\/\/www.growwithstudio.com\/privacy\",\"name\":\"Privacy\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages\/4992"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=4992"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages\/4992\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=4992"}],"wp:term":[{"taxonomy":"folder","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/folder?post=4992"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}