{"id":4995,"date":"2019-06-25T15:13:45","date_gmt":"2019-06-25T15:13:45","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?page_id=4995"},"modified":"2020-11-12T14:24:52","modified_gmt":"2020-11-12T20:24:52","slug":"terms","status":"publish","type":"page","link":"https:\/\/www.growwithstudio.com\/terms","title":{"rendered":"Terms"},"content":{"rendered":"\n<h2>Terms of Service<\/h2>\n<p>Effective Date: November 12, 2020<\/p>\n<p>These Terms of Service (“Terms”) constitute an agreement (the &#8220;Agreement&#8221;) between you (&#8220;Customer&#8221;, &#8220;You&#8221;, or &#8220;Your&#8221;) and Studio, a subsidiary of Volusion, LLC which is a Delaware limited liability company (“We”, “Us” or “Our”). This agreement sets forth the terms and conditions of Your use of Studio services (“Services”), a description of which is provided at <a href=\"https:\/\/www.growwithstudio.com\/\">www.growwithstudio.com<\/a>. &nbsp;<\/p>\n<p>If the person entering into this Agreement is acting on behalf of an entity, all references to &#8220;Customer&#8221;, &#8220;You&#8221; and &#8220;Your&#8221; shall refer to such entity and such person represents that it has the authority to bind such entity to this Agreement.&nbsp; You further agree that that any person entering into this Agreement on behalf of an entity has full authority to do so. For individuals, the Services are available only to those who are at least eighteen (18) years of age and recognized as being able to form legally binding contracts under applicable law.&nbsp;<\/p>\n<p>By using Our Services, You are agreeing to this Agreement and that any previous agreements between You and Us with respect to the Services are superseded by this Agreement.&nbsp; We may change or modify this Agreement at any time at Our discretion. Any such changes or modifications shall be effective immediately upon the earlier of (i) Our email notification to You advising You of such changes or modifications, (ii) Your electronic acceptance of the revised Agreement after such changes or modifications have been made as indicated by the &#8220;Last Revised&#8221; date at the top of this page, or (iii) Your continued use of the Services after We post the amended Agreement to this website.<\/p>\n<h3><strong>1. &nbsp; Our Services<\/strong><\/h3>\n<p>We will provide to You those Services to which You subscribe or that You purchase (the &#8220;Purchased Services&#8221;) through a purchase agreement.&nbsp; Some of Our Services are offered through plans. The fees for each plan, and their applicable terms and limits, will be described in each purchase agreement.&nbsp;<\/p>\n<p>We reserve the right to refuse, modify, or suspend all or any part of Our Services for any reason, at any time with or without notice.&nbsp; We shall not be liable to You or to any third pary for any such refusal, modification or suspension.&nbsp;<\/p>\n<p>We may update and modify Our Services from time to time. We will not be responsible for the effect an update has on any code not provided by Us. Any modifications to such code necessary to restore functionality to Your Site shall be Your sole responsibility.<\/p>\n<p>Verbal or written abuse of any kind (including threats of abuse or retribution) of any Studio customer, Studio employee, member, or officer can, at Our sole discretion, result in immediate Account suspension or termination.<\/p>\n<h3><strong>2. &nbsp; Your Obligations and Restrictions<\/strong><\/h3>\n<p>We may suspend the Purchased Services to You with or without notice and without liability if: (a) We reasonably believe that You are using the Services in violation of the Agreement; (b) You don&#8217;t cooperate with Our reasonable investigation of any suspected violation of the Agreement; (c) there is an attack on Your Site(s) or Your Site(s) are accessed or manipulated by a third party without Your consent, (d) We are required by law, or a regulatory or government body, to suspend Your Services; or (e) there is another event for which We reasonably believe that the suspension of Services is necessary to protect Our other customers. We will use commercially reasonable efforts to give You advance notice of any such suspension unless We determine that a suspension on shorter notice or without notice is necessary to protect Us or Our other customers from imminent risk.<\/p>\n<p>You understand and agree that Your Site(s) are Your responsibility, and You are solely responsible for compliance with any and all applicable laws or regulations related to Your Sites including but not limited to privacy and data laws, accessibility laws and trademark\/copyright laws. This includes, without limitation, Your Sites, the content thereon, and design thereof. You agree to comply with all applicable domestic and international laws and regulations regarding Your use of the Services. We are not liable for, and won’t provide You with any legal advice regarding, Your Site(s), the content thereon, or design thereof.<\/p>\n<h3><strong>3. &nbsp; &nbsp; Confidentiality<\/strong><\/h3>\n<p>We will not intentionally disclose Your confidential information to third parties, except as required in the course of providing Our Services or as otherwise described in this Agreement or Our Privacy Policy. Confidential information includes any materials or information provided by You to Us that is not publicly known (“Your Confidential Information”). Your Confidential information does not include information that: (a) was in the public domain at the time We received it; (b) comes into the public domain after We received it through no fault of ours; (c) We received from someone other than You without breach of Our or their confidentiality obligations; or (d) We are required by law to disclose.<\/p>\n<p>In order to permit Us to protect the quality of Our Services, You hereby consent to Our staff accessing Your Site(s) from time to perform the Services set forth herein during the term of the Agreement.<\/p>\n<p>You understand that Your Content, other than credit card information or data, may be transferred unencrypted over various networks and may be modified to the extent necessary to conform and adapt to technical requirements of connecting networks or devices. Credit card information or data, however, is always encrypted during transfer to or by Us.<\/p>\n<p>We claim no ownership or intellectual property rights in Your Content.<\/p>\n<h3><strong>4. &nbsp; Our Property<\/strong><\/h3>\n<p>The Services, and all other materials provided by or through Us, including, but not limited to, software, all informational text, software documentation, design of and &#8220;look and feel,&#8221; layout, photographs, graphics, audio, video, messages, interactive and instant messaging, design and functions, files, documents, images, or other materials, whether publicly posted or privately transmitted as well as all derivative works thereof (collectively, &#8220;Our Intellectual Property&#8221;), are owned by Us or other parties that have licensed their material or provided services to Us, and are protected by copyright, trademark, trade secret and other intellectual property laws.<\/p>\n<p>All of Our trademarks and service marks, logos, slogans and taglines, including “Studio”, are Our property. All other trademarks, service marks, logos, slogans and taglines are the property of their respective owners. Except as otherwise specifically provided herein, nothing should be construed as granting any license or right to use any trademarks, service marks, logos, slogans or taglines of Ours or any third party without Our express written permission, or the express written permission of such party that may own the trademark, service mark, logo, slogan or tagline.<\/p>\n<p>Subject to the limited rights expressly granted to You hereunder, We and Our licensors reserve all of Our\/their right, title and interest in and to the Services, including all of Our\/their related intellectual property rights. No rights are granted to You hereunder other than as expressly set forth herein.<\/p>\n<p>Subject to this Agreement, We hereby grant You a limited, revocable, non-transferable and non-exclusive license to use Our Intellectual Property to the extent, and only to the extent, necessary to access and use the Purchased Services in accordance with the terms of this Agreement.<\/p>\n<p>You may not (and shall not allow any third party to): (a) use the Services outside of the scope of the limited license herein granted; (b) sublicense, distribute, copy, reproduce, resell, modify, adapt, translate, or prepare derivative works from, to the Services without Our prior written permission; or (c) reverse engineer, disassemble, or decompile any software or otherwise attempt to discover any source code or trade secrets related to the Services.<\/p>\n<p>You may use Our trade name, trademarks, and service marks in connection with advertising and publicity, provided that You obtain prior written approval from Us. However, You need not obtain Our prior written approval where use of Our Studio marks is limited to inclusion in a list of services via which Your Content is available.<\/p>\n<h3><strong>5. &nbsp; Your Names and Trademarks<\/strong><\/h3>\n<p>You hereby grant to Us a non-exclusive right and license to Your name, trade names, trademarks, and service marks as are provided to Us in connection with this Agreement for Our use (a) on Our own websites, (b) in printed and online advertising, publicity, directories, newsletters, and updates describing Our Services, and (c) as reasonably necessary and ancillary to the foregoing.<\/p>\n<h3><strong>6. &nbsp; Fees and Payment<\/strong><\/h3>\n<p>If Your Purchased Services include Services that we offer for a fee (“Paid Services”), You agree to pay Us all such fees when due. These fees may include subscription fees, transaction fees and overage fees, the prices and terms of which are listed on Your purchase agreement. Only Services and features clearly indicated as &#8220;free&#8221; or &#8220;no charge&#8221; are free or without charge.<\/p>\n<p>Any payments of fees are due upon purchase, and the applicable Paid Services will not begin until payment is received. Payments for Paid Services that are billed on a recurring basis are due on or before the beginning of each term of such subscription. We offer billing only via credit card or debit card. Credit card and debit card information, including card numbers, should be only submitted to Us through our online checkout feature or the administrative features of Our Services or via phone, and should never be sent to us via email, IM, chat or any other method of communication.&nbsp;<\/p>\n<p>It is Your obligation to review all charges for accuracy. Failure to dispute a charge within 45 days following such charge shall constitute Your agreement that such charges are valid and You agree to waive any claims You may have had regarding such charge.<\/p>\n<p>If a payment of Yours to Us is returned or rejected, or incurs additional costs for Us (e.g., bank fees) for any reason, then You may be charged a service fee of $40 per incident and be required to reimburse all such fees and costs incurred by Us.<\/p>\n<p>All amounts that are past due are subject to a late payment penalty of 1.5% per month, or the maximum amount permitted by law, whichever is greater, until fully paid.&nbsp;<\/p>\n<p>We reserve the right to seek collection of all past due amounts (including by referral to third party collectors), plus all reasonable legal fees (including reasonable attorneys’ fees) and costs associated with such collection.<\/p>\n<p>All sales are final and We offer no refunds of any kind unless otherwise expressly noted.<\/p>\n<h3><strong>7. &nbsp; Your Feedback<\/strong><\/h3>\n<p>Any ideas, questions, opinions, recommendations, feedback or other information related, directly or indirectly, to any of Our products and services (&#8220;Your Feedback&#8221;) communicated to Us, whether by email, Our online forums, interactions with our sales or support representatives, including through chat or IM, or other communication, are considered to be non-confidential and non-proprietary. You hereby grant to Us, a worldwide, non-exclusive, perpetual, irrevocable, royalty-free, fully-paid, sublicenseable and transferable right and license to incorporate, use, publish and exploit Your Feedback for any purpose whatsoever, commercial or otherwise, without acknowledgment or compensation to You or to anyone else.<\/p>\n<h3><strong>8. &nbsp; Indemnification<\/strong><\/h3>\n<p>You irrevocably agree to indemnify, defend and hold harmless Us, Our affiliates, directors, officers, employees and agents from and against any and all claims, demands, actions, causes of action, suits, proceedings, losses, damages, costs, and expenses, including reasonable attorneys’ fees and fees attributable to in house legal personnel, arising from of or related to (i) Your breach of this Agreement or Your violation of any law or rights of any third party, (ii) Your Content and\/or Design or (iii)any claim by, on behalf of or against Your end users, and (iv) Your violation of any law or regulation or the rights, including intellectual property rights, of any third party.<\/p>\n<h3><strong>9. &nbsp; DISCLAIMER OF WARRANTIES<\/strong><\/h3>\n<p>YOU SPECIFICALLY ACKNOWLEDGE AND AGREE THAT YOUR USE OF THE SERVICES IS AT YOUR OWN RISK AND THAT THE SERVICES ARE PROVIDED &#8220;AS IS&#8221;, &#8220;AS AVAILABLE&#8221; AND &#8220;WITH ALL FAULTS&#8221;. WE DISCLAIM ALL WARRANTIES, STATUTORY, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY IMPLIED WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.<\/p>\n<p>WE MAKE NO REPRESENTATIONS OR WARRANTIES ABOUT (I) THE ACCURACY, COMPLETENESS, OR CONTENT OF OUR WEBSITE OR ANY WEBSITES LINKED (THROUGH HYPERLINKS, BANNER ADVERTISING OR OTHERWISE) TO OUR WEBSITE, OR (II) THE SERVICES, AND WE ASSUME NO LIABILITY OR RESPONSIBILITY FOR THE SAME.<\/p>\n<p>EXCEPT AS OTHERWISE PROVIDED HEREIN, WE MAKE NO WARRANTY THAT OUR SERVICES WILL BE UNINTERRUPTED, ERROR-FREE, OR COMPLETELY SECURE. YOU ACKNOWLEDGE THAT THERE ARE RISKS INHERENT IN INTERNET CONNECTIVITY AND ACTIVITY THAT COULD RESULT IN THE LOSS OF YOUR PRIVACY, CONFIDENTIAL INFORMATION AND PROPERTY.&nbsp;<\/p>\n<p>YOU ARE SOLELY RESPONSIBLE FOR THE ACCURACY, APPROPRIATENESS, AND LEGALITY OF ALL DATA, DESIGN AND CONTENT WITHIN YOUR SITE.<\/p>\n<p>NO ORAL OR WRITTEN INFORMATION OR ADVICE PROVIDED BY US OR OUR PARENTS, AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES, OR AGENTS, WHETHER DIRECTLY OR INDIRECTLY, WILL CREATE A WARRANTY OF ANY KIND NOR WILL IT CONSTITUTE PERSONAL, LEGAL OR FINANCIAL ADVICE. IN ADDITION, YOU ACKNOWLEDGE AND AGREE THAT ANY DATA, INFORMATION, CONTENT OR MATERIALS CONTAINED IN OR MADE AVAILABLE IN CONNECTION WITH THE SERVICES IS NOT INTENDED AS A SUBSTITUTE FOR, THE KNOWLEDGE, EXPERTISE, SKILL AND JUDGMENT OF A TAX, LEGAL OR OTHER PROFESSIONAL. YOU ARE RESPONSIBLE FOR OBTAINING SUCH ADVICE.<\/p>\n<p>FURTHER, WE DO NOT MAKE ANY REPRESENTATION OR WARRANTIES THAT THE SERVICES ARE APPROPRIATE OR AVAILABLE FOR USE IN ALL GEOGRAPHIC LOCATIONS. YOU USE OUR SERVICE AT YOUR SOLE RISK. THE SERVICE IS PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS WITHOUT ANY WARRANTY OR CONDITION, EXPRESS, IMPLIED OR STATUTORY.&nbsp;<\/p>\n<p>THESE DISCLAIMERS OF REPRESENTATIONS AND WARRANTIES SHALL APPLY TO THE FULLEST EXTENT PERMITTED BY LAW AND SHALL SURVIVE ANY TERMINATION OR EXPIRATION OF THIS AGREEMENT OR YOUR USE OF THIS WEBSITE OR THE SERVICES.<\/p>\n<p>SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, THEREFORE, SOME OF THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU.&nbsp;<\/p>\n<h3><strong>10. &nbsp; LIMITATION OF LIABILITY<\/strong><\/h3>\n<p>WE ARE NOT LIABLE TO YOU OR ANY OTHER PERSON FOR DAMAGES OF ANY KIND, INCLUDING WITHOUT LIMITATION ANY PUNITIVE, EXEMPLARY, CONSEQUENTIAL, INCIDENTAL, INDIRECT OR SPECIAL DAMAGES (INCLUDING, WITHOUT LIMITATION, ANY PERSONAL INJURY, LOST PROFITS, BUSINESS INTERRUPTION, LOSS OF PROGRAMS OR OTHER DATA ON YOUR COMPUTER OR OTHERWISE) ARISING FROM OR IN CONNECTION WITH USE OF OUR SERVICES, YOUR CONTENT, THIRD PARTY SERVICES, THIRD PARTY SITES OR THIRD PARTY CONTEN, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.&nbsp;<\/p>\n<p>YOU HEREBY WAIVE THE PROVISIONS OF ANY STATE OR LOCAL LAW LIMITING OR PROHIBITING A GENERAL RELEASE.IN THE EVENT OF ANY PROBLEM WITH OUR WEBSITE, THE SERVICES OR OUR INTELLECTUAL PROPERTY, YOU AGREE THAT YOUR SOLE AND EXCLUSIVE REMEDY IS TO CEASE USING THE SERVICES.&nbsp;<\/p>\n<p>THE FOREGOING LIMITATION OF LIABILITY SHALL APPLY TO THE FULLEST EXTENT PERMITTED BY LAW AND SHALL SURVIVE ANY TERMINATION OR EXPIRATION OF THIS AGREEMENT OR YOUR USE OF THIS SITE OR THE SERVICES FOUND AT THIS SITE.<\/p>\n<p>SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, THEREFORE, SOME OF THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU.&nbsp;<\/p>\n<h3><strong>11.<\/strong><strong>\t<\/strong><strong>Governing Law, Forum Selection, and Jurisdiction<\/strong><\/h3>\n<p>This Agreement shall in all respects be governed by, interpreted and construed with, according to, and by the laws of the State of Texas, excluding its conflicts of laws rules, and the United States of America.&nbsp;<\/p>\n<p>You hereby consent to (and waive all defenses of lack of personal jurisdiction and forum non conveniens with respect to) the jurisdiction and venue of the Federal District Court for the Western District of Texas, Austin Division (located in Austin, Texas) and the jurisdiction of Texas state courts generally, and specifically in Travis County, Texas, USA. You agree to waive the right to trial by jury in any action or proceeding that takes place relating to or arising out of this Agreement. The United Nations Convention on Contracts for the International Sales of Goods does not apply to this Agreement.<\/p>\n<p>You hereby also unconditionally and irrevocably agree that all actions, suits, and\/or proceedings arising out of or relating directly or indirectly to or in any way arising out of this Agreement or any ancillary agreement or any other related obligations must be litigated solely and exclusively in the Federal District Court for the Western District of Texas, Austin Division or in the state court of Texas located in Travis County, City of Austin, in Texas. You further agree that such courts are convenient forums.<\/p>\n<p>If a court of competent jurisdiction rules that one or more of the provisions contained in this Agreement is unenforceable in any respect, then such provisions will be modified as necessary to be enforceable while reflecting the parties&#8217; original intentions to the greatest extent possible. All remaining provisions of this Agreement shall remain in full force and effect without modification.<\/p>\n<p>You may only resolve disputes with us on an individual basis and may not bring a claim as a plaintiff or a class member in a class, consolidated or representative action. Class actions, class arbitrations, private attorney general actions and consolidation with other arbitrations aren&#8217;t allowed.<\/p>\n<h3><strong>12. &nbsp; Privacy Policy<\/strong><\/h3>\n<p>We encourage you to read our <a href=\"\/privacy\">Privacy Policy<\/a>, and to use the information it contains to help you make informed decisions.<\/p>\n<h3><strong>13. &nbsp; Additional Terms for Design Services<\/strong><\/h3>\n<p>These Additional Terms apply to You if You purchase any of our website design and development services (“Design Services”).<\/p>\n<p><strong>Definitions<\/strong><\/p>\n<p>“Content” means all data, graphics, links, photos, music, sound, messages, videos and other data used in the Custom Work Product.<\/p>\n<p>“Custom Work Product” means all HTML files, Java files, graphics files, animation files, data files, technology, scripts and programs, both in object code and subject code form, all documentation and any other deliverable prepared for You by Us in accordance with the Statement of Work (defined below).<\/p>\n<p>“Customer Work Product” shall not include any Generic Modules, Third Party Content (as defined below) or any of Our Technology.<\/p>\n<p>&#8220;Generic Modules&#8221; means discrete computer program subroutines that are not specific to the functions of the Custom Work Product but are useful generally in Our business and that are designated as &#8220;Generic Modules&#8221; in writing signed by both parties.<\/p>\n<p>&#8220;Intellectual Property&#8221; means intellectual property or proprietary rights, including but not limited to copyright rights, trademarks, moral rights, patent rights (including patent applications and disclosures), rights of priority, mask work rights, and trade secret rights, recognized in any country or jurisdiction in the world.<\/p>\n<p>&#8220;Our Technology&#8221; means any and all software, applications, tools, technology, Intellectual Property, know how, algorithms, procedures, techniques and solutions that We have already developed or that We license from a third party and that are incorporated into or used in the design, development, testing, hosting and distribution of the Custom Work Product, together with any improvements thereon.<\/p>\n<p><strong>Design Services<\/strong><\/p>\n<p>We agree to provide Our Design Services substantially in accordance with the information and specifications provided by You in responses to the Design Preferences Form and submitted to and accepted by Us (the &#8220;Statement of Work&#8221;). You understand that Our obligations are limited to those expressly set forth in the Statement of Work. Any changes or modifications outside of the scope of the specifications in the Statement of Work may require a change order and are subject to additional fees.<\/p>\n<p>Additionally, by providing Our Design Services, We have not and do not undertake any obligation to comply with any laws, regulations, or rules that may or may not apply to you. You understand and agree that, regardless of the scope of Our Design Services, Your Site(s) and Your End Users are Your responsibility, and You are solely responsible for compliance with any and all applicable laws or regulations related to Your Site(s) and Your End Users including but not limited to privacy and data laws, accessibility laws and trademark\/copyright laws. This includes, without limitation, Your Site(s), the content thereon, and design thereof. You agree to comply with all applicable domestic and international laws and regulations regarding Your use of the Services. You agree to post a privacy policy on Your Site(s) that complies with the laws applicable to Your business. You also agree to obtain consent from Your customers for the use and access of their personal information by Us and other third parties. We are not liable for, and won’t provide You with any legal advice regarding, Your Site(s), the content thereon, design thereof, or Your End Users.<\/p>\n<p><strong>Content<\/strong><\/p>\n<p>Unless otherwise specified in the Statement of Work, You are required to provide all Content for use in the Custom Work Product. If the Statement of Work or any other terms of Our Design Services purchased by You provide that We shall use Content owned by a third party (“Third Party Design Content”), You will be responsible for all fees and expenses associated with such Content and will only be entitled to a license to such Third Party Design Content as set forth in any agreement with such third party. In any such circumstance, You remain responsible for any violation of any Third Party Design Content, and any potential violations of Intellectual Property rights. We are not liable for and won’t provide You with any legal advice regarding any such Intellectual Property rights.&nbsp;<\/p>\n<p><strong>Testing<\/strong><\/p>\n<p>We will provide You with a link to the work designed, created, and\/or produced by Us in connection with this Agreement and as further set forth in the Statement of Work (the &#8220;Deliverables&#8221;). You shall have 14 days after We provide the link to inspect and test the Deliverables to determine if it substantially conforms to the Statement of Work. You may request revisions to the Deliverables, but unless otherwise stated in the Statement of Work, such revisions are limited to two rounds.&nbsp;<\/p>\n<p>If the Deliverables fail to substantially conform to the specifications in the Statement of Work, You shall give Us written notice of the failure describing the defect in the Deliverable with sufficient specificity so as to allow Us to easily identify and rectify the failure. In order to be effective and binding, such notice shall be sent no later than 30 days from the date of conclusion of Our Design Services, and shall include specific page, file or URL references and detailed information about the nature of the defect.&nbsp;<\/p>\n<p>Note that there may be some slight inconsistencies between any design proofs that We deliver to You and the Deliverables as a result of the actual coding of the Deliverables. Additionally, We may, after consultation with You, utilize a content builder or other solution that would enable You to more easily edit and maintain Your Site, which may limit our ability to completely implement certain design features.<\/p>\n<p><strong>Time to Cure<\/strong><\/p>\n<p>After receipt of notice of a material non-conformity which complies with this Agreement, We will use commercially reasonable efforts to remedy such failure or defect within 30 days of the delivery of such notice, and shall redeliver such Deliverables to You. You shall have 14 days after such redelivery to inspect and test the Deliverables to determine if it conforms to the Statement of Work. If the Deliverables continue to fail to materially conform to the specifications in the Statement of Work, then: (i) either Party may terminate this Agreement; or (ii) if both Parties agree, We will be given an opportunity to cure any defects in accordance with this section.<\/p>\n<p><strong>Acceptance<\/strong><\/p>\n<p>The Deliverables shall be deemed to be accepted by You upon the earlier of (a) written notice by You to Us of such acceptance or (b) expiration of the time period for Your inspection without written notice in accordance with this Agreement to Us of material non-conformance. We shall not unreasonably withhold or delay acceptance.<\/p>\n<p><strong>Mirroring Design<\/strong><\/p>\n<p>The Deliverables are provided for use only on the domain designated in the Statement of Work. If You want to mirror the design on one or more different domains, You must submit an order identifying the new or additional domain. The initial mirroring may be completed without additional charge; however any future updates or modifications to the design will require additional fees on a per domain basis.<\/p>\n<p><strong>Grant of License<\/strong><\/p>\n<p>Upon full and final payment of all fees for Our Development Services, We will grant to You a limited, nonexclusive, license to use, reproduce, display, and perform, works based upon (1) the Deliverables, (2) any of Our Technology, the Generic Modules, and all Intellectual Property rights contained in the Custom Work Product on the designated domain. Unless otherwise provided by Us, this license shall only extend to the extent necessary for You to maintain a website while hosted with Us.<\/p>\n<p><strong>Our Intellectual Property<\/strong><\/p>\n<p>The Custom Work Product, Our Services, Our Technology, Our Content, the Generic Modules, and all Intellectual Property rights with respect to any of the foregoing are and will remain Our sole and exclusive property.<\/p>\n<p><strong>Your Content<\/strong><\/p>\n<p>You acknowledge and agree that (a) unless expressly stated elsewhere, We have no proprietary, financial, or other interest in Your Content; (b) We do not, by virtue of offering or hosting Your Content, edit, distribute, market, sublicense, publish, or otherwise provide Your Content to end users; and (c) You are solely responsible for the information, data, graphics, text, quality, performance, and all other aspects of Your Content. You warrant that You own or have the right to use and offer Your Content in the manner in which Your Content is offered and will be offered by Your during the term of this Agreement.<\/p>\n<p>You further acknowledge and agree that You are solely responsible for ensuring the integrity of Your Content. Although We may, from time to time, provide data backup services, You are advised that We are not an insurer and are in no way responsible for any damages resulting from the loss of Your Content. You are solely responsible for backing up\/archiving Your Content.<\/p>\n<p>You hereby grant to Us a non-exclusive, worldwide, perpetual, royalty free license to reproduce, modify, display, perform, adapt, transmit, distribute, improve, and otherwise use customer content in connection with Our Development Services.<\/p>\n<p><strong>Our Right to Re-Use Deliverables<\/strong><\/p>\n<p>You acknowledge and agree that We use some or all of the Custom Work Product, including the Deliverables (but excluding any of Your Content) in the future in commercial development projects for other customers. Nothing in this Agreement shall be construed to limit Our right to do so or to use any information in non-tangible form retained by Us as ideas, information and understandings retained in the human memories of its employees, contractors and agents, provided that We may only use information of general applicability and not Your Confidential Information.<\/p>\n<p><strong>Cooperation<\/strong><\/p>\n<p>You agree to provide reasonable assistance and cooperation to Us to acquire, transfer, maintain, perfect, and\/or enforce the Intellectual Property rights in Your Site(s) (excluding any of Your Content) and Custom Work Product, including, but not limited to, execution of a formal assignment or such other documents as may be reasonably requested by Us. You hereby appoint Our officers as Your attorneys in fact to execute such documents on Your behalf for this purpose.<\/p>\n<p><strong>Security Interest<\/strong><\/p>\n<p>To the extent that You have any interest or right with respect to the Deliverables, such interest or right shall be subject to (and You hereby grant to Us) a security interest to the extent of the difference between the payments that are due and the payments that are actually made by You for such Deliverables. Upon Our request, You shall execute any instrument required to perfect such security interest.<\/p>\n<p><strong>Fees for Design Services<\/strong><\/p>\n<p>The purchase of Our Development Services is a purchase of the time and creativity of Our Design Services team. As such, this is a limited resource and We require that purchases be consummated within a reasonable amount of time. If You purchase Our Design Services, you must provide the required input within one (1) month of your order date. Failure to timely provide the required input to initiate the design or to timely respond to additional inquiries will result in the services being deemed closed and delivered in full and complete satisfaction of this Agreement and any and all of Our obligations herein. No further services will be provided without the purchase of additional services and You will not be entitled to a refund.<\/p>\n<p>While the sale of Our Design Services are final and without a right to refund, We understand that Our Design Services require a longer involvement and circumstances may change. In order to provide flexibility to You, We allow refunds only under the following circumstances: If after the initial consultation with Our team, You no longer wish to purchase the design package, You may notify Us within one (1) business day to obtain a full refund. Once Our team has begun work on the project, full refunds are no longer available. A partial, pro-rated refund may be obtained within thirty (30) days after Your initial input is required for the specified service. Such refund will be prorated to compensate Us for any expenditure in time, money or other resources already spent on the partial provision of the services.&nbsp;<br><\/p>\n<h3><strong>14.   Additional Terms for Marketing Services<\/strong><\/h3>\n<p>All terms not otherwise defined herein shall have the definitions set forth in the <a href=\"https:\/\/www.volusion.com\/terms-of-service\">Terms of Service<\/a>.<\/p>\n<p>These Marketing Services Additional Terms (these &#8220;Additional Terms&#8221;) are effective as of the date set forth above, and are a part of Our overall Terms of Service (&#8220;Terms of Service&#8221;).<\/p>\n<p>You agree to be bound by these Additional Terms if You purchase Our marketing services, which include pay-per-click (“PPC”), feed services, email marketing, search engine optimization (“SEO”) services and social media marketing (collectively, “Marketing Services”). Our Marketing Services and any plans available are described on Our website.<\/p>\n<p>Our Marketing Services may require that You provide certain information or access to third party services. We may require You to answer certain questions, provide input or other critical feedback. In addition, some of Our Marketing Services may require that You provide to Us administrative\/backend access to your websites or access to certain third party services such as Google, Microsoft, Yahoo, Facebook or Twitter. You agree to provide to Us such information and access to such third party services as is necessary to perform Our Marketing Services.<\/p>\n<p>We will not be held responsible for delays caused by Your failure to provide requested information or access to third party services in a timely manner. If You fail to provide the required information or access to third party services within one (1) month of a request, We may terminate the Marketing Services, and You will not be entitled to any refunds or credits.<\/p>\n<p>Any third-party services used by You or created by You or on Your behalf in connection with the Marketing Services are Your responsibility. You will be required to agree to any terms and conditions required for Your use of such Third Party Services, and to pay any and all fees charged. You are responsible for maintaining the security of the account information (user name, password, etc.) for any third party services in which You provide access to Us. Care should be taken in storing and sharing passwords, and We recommend that You do not send account information by any means that are not encrypted. If You change any of the account information at any time during which We are providing Our Marketing Services, You must notify Us immediately of such change.<\/p>\n<p>You are responsible for all fees and costs charged by third parties in connection with their services, including any costs per view or costs per visit fees for PPC campaigns, fees associated with services such as Facebook Advertising or Twitter Advertising, and any other fees charged by third parties.<\/p>\n<p>Some of Our Marketing Services may require Us to use Your name, trade names, trademarks and service marks. You hereby grant to Us a non-exclusive right and license to Your name, trade names, trademarks, service marks and other intellectual property only to the extent necessary to provide the Marketing Services. This license shall terminate with respect to any Marketing Services upon the termination or expiration of the term of such services.<\/p>\n<p>In connection with Our Marketing Services, We may provide original or additional content in electronic format for such services or for the purpose of creating additional or richer web pages. Additional fees may apply. This may include &#8220;ghostwriting&#8221; certain articles on Your behalf to be attributed to an individual within Your organization (usually the owner) when published on Your blog and third party websites. You have the option to approve or suggest changes to articles within 2 business days of completion. If You suggest modifications, changes will be implemented and the article will be published without further delay. If You do not respond within 2 business days (Monday through Friday excluding Holidays), approval is assumed and the article will be published.<\/p>\n<p>You acknowledge that the efficacy of Our Marketing Services may be dependent on third party services such as Google, Microsoft, Yahoo, Facebook or Twitter. We will not be held liable for any changes in their algorithms, rules, policies or procedures that may adversely impact the campaign and\/or cause it to be paused or disapproved.<\/p>\n<p>We are not liable for any loss of ranking or traffic and We do not guarantee any increase in sales.<\/p>\n<p>We will not offer any Marketing Services to any site that violates Our <a href=\"https:\/\/www.volusion.com\/acceptable-use-policy\">Authorized Use Policy<\/a>, as determined in Our sole discretion.<\/p>\n<p>Our full Marketing Services are available to Our customers on Our Volusion platform. However, we may perform some of Our Marketing Services on other ecommerce platforms. If We do, We may not provide all of the services included in the Marketing Services that You would receive if on the Volusion platform.<\/p>\n<p>Subject to Section 10 of Our <a href=\"https:\/\/www.volusion.com\/terms-of-service\">Terms of Service<\/a>, You will be charged the fees for Our Marketing Services as described in the plan that You purchase, on the frequency and for a term that is set forth in such plan. Unless otherwise specified in a plan or unless You provide written notification of your intent to cancel prior to the end of the term, on the final date of the term, We will automatically renew Your&nbsp; Marketing Services for an additional term, equal in length to the previous term. We do not offer refunds for fees paid, including prepaid fees. Unless otherwise specifically provided in any plan for Our Marketing Services or these Additional Terms, if You terminate such plan, You are liable for all fees to be paid for the remainder of any term.<\/p>\n<p><strong>PPC<\/strong><\/p>\n<p>If You purchase our PPC services, We will create, manage and optimize Your Google or Bing PPC campaigns, as more particularly described on Our website (“Our PPC Services”). The scope of Our PPC Services plans and the fees charged are described on Our website or in materials to be delivered to You. Our plans provide that We manage a certain ad spend for a management fee. This ad spend is estimated per day and may exceed a given day&#8217;s budget by as much as 20% but will not exceed the agreed upon total per month. We also offer custom plans, the terms of which will be described to You prior to purchase.<\/p>\n<p>We will use Our commercially reasonable efforts to qualify visitors under Our PPC Services. However, We do not guarantee the number of conversions produced by visitors or that clicks are not fraudulent.<\/p>\n<p><strong>Social Media Marketing<\/strong><\/p>\n<p>If You purchase our social media marketing services, We will manage Your social media accounts, such as Facebook and Twitter, and campaigns (“Our Social Media Marketing Services”). We offer Our Social Media Marketing Services via custom plans, the terms of which will be described to You prior to purchase.<\/p>\n<p>In providing Our Social Media Marketing Services, We will post updates and\/or original profile content to Your social media accounts on an agreed upon schedule, as more particularly described on Our website or in materials to be delivered to You. We will manage responses and interactions related to the content that We post. We will not manage or respond to posts not related to content not provided by Us (including, but not limited to, product\/service inquiries, complaints and requests for refunds).<\/p>\n<p>We are not responsible for scheduled content not posted as a result of Your failure to provide timely approvals or to update Volusion with your social media account information. We do not guarantee that the Social Media Marketing Services or any associated post will generate any additional conversions.<\/p>\n<p>The Social Media Marketing Services may include Facebook Advertising, Twitter Advertising and\/or Pinterest Advertising, as agreed upon by the parties. For all such Advertising Services, We agree to use Our commercially reasonable efforts to not fraudulently increase the number of clicks, “Likes” or “pins” any ad or boosted post generates. However, we do not guarantee the number of clicks, “Likes” or “pins” or associated conversions produced by visitors. Further, we cannot control who may “Share” or “Retweet” or “repin”, or otherwise forward, advertisements generated by Us. All such Advertising Services shall be additionally governed by the service specific terms below.<\/p>\n<p>Facebook and Instagram Advertising<\/p>\n<p>In addition to the basic Facebook advertising that may be provided as a part of Social Media Marketing Services, You may select to purchase Facebook Advertising Services from Volusion separate from Social Media Marketing Services, which includes Facebook and Instagram. This additional service may have a spend limit as defined by Us. If You purchase Facebook Advertising services, We agree to create and manage Facebook advertising campaigns for a fee. You acknowledge that all Facebook Advertising Services are furnished by using third party applications and tools and as such are limited by the capabilities of such applications and tools. You further agree to be bound by any terms and conditions required by such third party applications and tools.<\/p>\n<p>Twitter Advertising<\/p>\n<p>If Your Social Media Marketing Service includes Twitter Advertising Services, We agree to create and manage Twitter advertising campaigns. This additional service may have a spend limit as defined by Us. You acknowledge that all Twitter Advertising Services are furnished by using third party applications and tools and as such are limited by the capabilities of such applications and tools. You further agree to be bound by any terms and conditions required by such third party applications and tools.<\/p>\n<p>Pinterest Advertising<\/p>\n<p>If Your Social Media Marketing Service includes Pinterest Advertising Services, We agree to create and manage Pinterest advertising campaigns. This additional service may have a spend limit as defined by Us. You acknowledge that all Pinterest Advertising Services are furnished by using third party applications and tools and as such are limited by the capabilities of such applications and tools. You further agree to be bound by any terms and conditions required by such third party applications and tools.<\/p>\n<p><strong>Email Marketing Services<\/strong><\/p>\n<p>If You purchase Our email marketing services, We will collaborate with you to create email campaigns highlighting your products and services (“Our Email Marketing Services”). All campaigns will be sent from a email accounts managed by Us on your behalf through third-party service providers.<\/p>\n<p>You will be required to regularly update your unsubscribe list. We are not responsible for emails sent to addresses that have unsubscribed or the resulting violations of any law or regulation caused by Your failure to timely update the list. We will use the information provided by You to comply with the identification requirements of the CAN-SPAM Act. Failure to provide accurate information or to timely update the information provided may result in a violation of laws or regulations governing email marketing. We shall have no liability for, and You shall indemnify us with respect to, any such violation. We will not send any email marketing that We, in Our sole discretion, determine to be spam or otherwise in violation of any law, regulation or the Volusion Acceptable Use Policy.<\/p>\n<p>Campaigns will be created in the standard format. Should You desire a custom design that is different from the standard format, please contact Us to get a quote. All campaigns are created in collaboration with You and will not be sent unless You have provided the appropriate approvals. No credits or refunds will be issued for missed campaigns that were delayed due to your untimely approvals. You also acknowledge that different email platforms may render the email format differently. As such the email format that You approved may be altered when viewed by a customer from a different format. Limitations contained in the email and other third-party tools may restrict certain format changes.<\/p>\n<p>While We create the email content, You are responsible for setting up and maintaining any links referenced in the email (i.e. social media accounts and\/or landing pages.)<\/p>\n<p><strong>SEO Services<\/strong><\/p>\n<p>If You purchase our SEO services, we will provide You with search engine optimization services for one or more of Your websites by using certain keywords and\/or phrases to improve the ranking and\/or positioning the contents of Your website in the search engines and\/or directories that are most frequently used by the general public (“Our SEO Services”).<\/p>\n<p>To provide Our SEO Services, You agree to:<\/p>\n<ul><li>authorize Us to make changes to Your Site for the purpose of optimization, and to communicate directly with any third parties if necessary;<\/li><li>grant to Us unlimited access to existing website traffic statistics for analysis and tracking purposes; and<\/li><li>license to Us the right to use Your intellectual property, including your logos, trademarks and copyrights, solely and for the express purposes of providing Our SEO Services.<\/li><\/ul>\n<p>We are not liable for any other changes or issues caused by other search engine optimization companies or by You or any third party. You agree to notify Us promptly if You engage in any other search engine optimization efforts, whether directly or through a third party, during the term of Our SEO Services.<\/p>\n<p>You acknowledge and agree that We do not have control over the policies of search engines with respect to the type of sites and\/or content that they accept now or in the future. Your website may be excluded from any directory or search engine at any time as the sole discretion of the search engine or directory.<\/p>\n<p>Due to the competitiveness of some keywords\/phrases, ongoing changes in search engine ranking algorithms, and other competitive factors, We do not guarantee any exact placement in any search engines (eg, #1 positions) or consistent position in a range (eg, top 10 positions) for any particular keyword, phrase or search term.<\/p>\n<p>Google has been known to hinder the rankings of new websites (or pages) until they have proven their viability to exist for more than 6 months. This is referred to as the “Google Sandbox”. We assume no liability for ranking\/traffic\/indexing issues related to Google Sandbox penalties.<\/p>\n<p>Linking to “bad neighborhoods” or getting links from “link farms” can seriously damage all SEO efforts. We do not assume liability for Your choice to link to or obtain a link from any particular website without prior consultation.<\/p>\n<p>Should You wish to terminate any SEO services prior to the end of the plan term, You agree to pay an early termination fee equal to 50% of the amounts due for the remainder of the plan term, payable upon termination.<\/p>\n<p><strong>Shopping Feeds<\/strong><\/p>\n<p>If You purchase our Shopping Feeds services, We will set up and manage Your Shopping Feeds campaign by submitting Your products to the shopping engine and placing bids (“Our Shopping Feeds Services”). The scope of Our Shopping Feeds Services plans and the fees charged are described on Our website or in materials to be delivered to You. Our plans provide that We manage a certain ad spend for a management fee. This ad spend is estimated per day and may exceed a given day&#8217;s budget by as much as 20% but will not exceed the agreed upon total per month. We also offer custom plans, the terms of which will be described to You prior to purchase.<\/p>\n<p>Our Shopping Feeds Services are subject to the terms and conditions of shopping engine services, and require lead times of up to 14 days while we wait on approval by the applicable shopping engine.<\/p>\n<p>We will use Our commercially reasonable efforts to qualify visitors under Our Shopping Feeds Services. However, We do not guarantee the number of conversions produced by visitors or that clicks are not fraudulent.<\/p>\n<h3><strong>15. Prior Versions<\/strong><\/h3>\n<p><a href=\"https:\/\/www.growwithstudio.com\/terms-previous\">Grow With Studio Terms of Service Effective April 1, 2019<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms of Service Effective Date: November 12, 2020 These Terms of Service (“Terms”) constitute an agreement (the &#8220;Agreement&#8221;) between you (&#8220;Customer&#8221;, &#8220;You&#8221;,&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page_no_sidebar.php","meta":[],"folder":[235],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms - Grow With Studio<\/title>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/terms\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Terms of Service Effective Date: November 12, 2020 These Terms of Service (“Terms”) constitute an agreement (the &#8220;Agreement&#8221;) between you (&#8220;Customer&#8221;, &#8220;You&#8221;,...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/terms\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:modified_time\" content=\"2020-11-12T20:24:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/04\/studio_icon-e1557248001420.png\" \/>\n\t<meta property=\"og:image:width\" content=\"72\" \/>\n\t<meta property=\"og:image:height\" content=\"55\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"37 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/terms#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/terms\",\"name\":\"Terms - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"datePublished\":\"2019-06-25T15:13:45+00:00\",\"dateModified\":\"2020-11-12T20:24:52+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/terms#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/terms\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/terms#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/terms\",\"url\":\"https:\/\/www.growwithstudio.com\/terms\",\"name\":\"Terms\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages\/4995"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=4995"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/pages\/4995\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=4995"}],"wp:term":[{"taxonomy":"folder","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/folder?post=4995"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}