{"id":6688,"date":"2020-04-14T09:12:00","date_gmt":"2020-04-14T14:12:00","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=6688"},"modified":"2020-06-10T10:52:08","modified_gmt":"2020-06-10T15:52:08","slug":"adjusting-your-business-strategy-for-covid-19","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19","title":{"rendered":"Adjusting Your Business Strategy For COVID-19"},"content":{"rendered":"\n<p>Few businesses are immune to the fundamental economic and lifestyle changes sparked by the COVID-19 crisis. As 52% of U.S. small businesses <a href=\"https:\/\/www.volusion.com\/blog\/covid-19-financial-assistance-for-smbs\/\">take measures to prepare for an economic slowdown<\/a>, this is a pivotal time to adopt strategies that embrace the new normal and build resilience for the future. We’ll walk you through some of these strategies and help you apply them to your own business.<\/p>\n<h3><strong>High-Level Approach to Adjusting Business Strategy<\/strong><\/h3>\n<p>When turbulent changes affect a society at large, you can often detect cultural and behavioral shifts that occur at a higher level within that society. If we know that the world of our consumer is changing in the broadest sense, then as adaptable businesses, we must also make high-level changes so we can better serve our customers. Set aside some time in your day to sit down and think through the big-picture adjustments to your business that meet your customers where they are. Strive to be proactive, rather than reactive.&nbsp;<\/p>\n<h4><strong>Maintain Relevance<\/strong><\/h4>\n<p>As your customer’s needs and spending habits change, products and services they used to love may become irrelevant. Think about how your customer’s way of life has changed and adjust your approach to ensure that you’re still selling something of value that embraces your customer’s new reality. We’ve seen this happening in several different industries already, with restaurants offering delivery as a standard service and fitness businesses pivoting to rental equipment and at-home workouts.&nbsp;<\/p>\n<h4><strong>Be Transparent<\/strong><\/h4>\n<p>As you make changes to your version of “business as usual”, keep your customers in the loop. This includes changes in business hours, shipping delays, and out of stock products. This type of transparency can also extend beyond the surface-level information; be honest with your customers about the challenges your business is facing. Don’t put on a fake “happy” face if things are hard. It’s okay to let your customers know that you are struggling too because we are all in this together!&nbsp;<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/AIX57wKZ5gFFLikUYFDF5mfTMeaaEFcamEy7JEhFy41gJV59gR1ACZ_iaT0-LquoqHeh3656hgsW04U_70PX92cKCQUpM5sJGDO1s7lD83z9n66pDuMxmq-qQqSz-A\" alt=\"\"\/><\/figure>\n<p>Build a stronger bond with your customers by keeping an open line of communication. While it may not make sense to share every last detail of your business’s COVID-19 struggles, if your business is taking a financial hit due to your brick and mortar closing down, reach out to your customers and encourage them to shop online to support your business. Building customer loyalty with an open line of communication will keep your business top-of-mind and help customers consider how your business’s products or services can help them during this time.&nbsp;<\/p>\n<h4><strong>Solve For The Customer First<\/strong><\/h4>\n<p>When our personal endeavors are put under stress, it’s natural to try to regain control of the situation. This is especially true for small businesses built from the ground up, as we are used to being in control at each stage of its development and evolution. However, we must realize when things are outside of our scope for control, and more importantly, understand how to respond in situations like these.&nbsp;<\/p>\n<p>It’s easy to become married to our ideas or solutions because we have poured so much of our hearts into them. While it&#8217;s important to be passionate about what you do, let go of aspects of your creation that don’t make sense anymore. Focus first on the issues the customer is facing and use that to guide new products, messages or solutions. Don’t be afraid to scrap an idea that you’ve spent time on if you realize that it ultimately won’t solve the customer’s problem.&nbsp;<\/p>\n<h4><strong>Tactical Approach<\/strong><\/h4>\n<p>Well-rounded strategies include both high-level, broad techniques and more immediately actionable solutions. We’ve compiled insights from our SEO, Design, Social Media, PPC, and general marketing experts so you can make more informed decisions about your business’s online strategy and respond to trends that have emerged during the COVID-19 pandemic.<\/p>\n<h2><strong>SEO<\/strong><\/h2>\n<p>When you need sales fast, SEO isn’t your strategy. The work pays off over the long term, often taking months before it yields meaningful results. Once you do start seeing ROI, though, your results will compound month over month even if you stop feeding the strategy. That makes SEO a powerful source of sustainable, long-term revenue. Think of it as regular exercise: you won’t see the results tomorrow, but if you put in the work consistently, you’ll notice the difference.&nbsp;<\/p>\n<p>Shore up your SEO foundation now so you can weather fluctuations in the future and add a vital, consistent revenue stream to your business.&nbsp;<\/p>\n<h4><strong>Focus Your Keyword Research On Search Intent&nbsp;<\/strong><\/h4>\n<p>Now more than ever, it’s important to tap into your target audience’s unique needs, concerns, questions, and values so you can meet your customers exactly where they are. To this end, keyword research has both long- and short-term benefits. Over the long term, identifying relevant, high-opportunity keywords and optimizing the priority pages on your site puts your business in front of the exact people who need the solution you offer. In the short term, keyword research data gives you direct insight into your audience’s search behavior so you can get on their wavelength with your content and messaging.&nbsp;<\/p>\n<p>To get started, identify your target audience and brainstorm a list of questions they might have, qualities they might want, and the pain points they need to solve. What factors do they consider before they purchase a product like yours? Add these to your list. This will become the seed list you’ll feed to the keyword research tool of your choice so you can identify the best keyword opportunities for your site.&nbsp;<\/p>\n<p>Think of keyword research not as a rote SEO process but as an invaluable way to learn how your audience thinks. As you optimize each priority page for 3-5 keywords, you can leverage your new insight right away by building the <em>exact <\/em>page your audience wants.&nbsp;<\/p>\n<h4><strong>Optimize for Both SEO and Conversions&nbsp;<\/strong><\/h4>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/fjpgzGazh84v7_gFJQycrtHOKmPS9yxwQqWRMHWz0afddhzwb3KycsuNWJyFDIqcV6Bg69YrSkV1L_R8Y6b1jUZ_zkQHm3_6GNh1grKJvwZZHLtm2qftXSA0kotaiw\" alt=\"\"\/><\/figure>\n<p>Like keyword research, on-page optimization has both long- and short-term benefits. While it’s driven by the goal of generating more organic traffic over the long term, its impact on conversions can be near-immediate — as long as you keep conversions top of mind when you optimize the page.&nbsp;<\/p>\n<p>That means your on-page optimizations might not stop at metadata updates and on-page content. Put the page’s design under the lens too and explore ways to make the page as useful and conversion-friendly as possible.&nbsp;<\/p>\n<p>First, identify where the page is in the buyer’s journey. What is the next step? How will you move your visitors there? If the page is early in the journey, how can you entice visitors to keep browsing? If it’s late in the journey, how can you give customers that last push to convert?&nbsp;<\/p>\n<p>Add strong, eye-catching calls to action to each page to make the next step in the journey feel intuitive. Your navigation can assist with this by guiding users through a logical flow of categories, products, and pages. Whenever possible, try not to make the user click more than three times to get to their final destination. You can use tools like faceted navigation to help them refine their criteria further if needed.&nbsp;<\/p>\n<p>Google your chosen keywords and take a look at the top-ranking pages in the SERPs. Since these are the pages that best satisfy the search intent according to Google, they’re great models to use as you build out your own page.&nbsp;<br><\/p>\n<h4><strong>Treat Slow Times As Ramp-up Periods<\/strong><\/h4>\n<p>Turn business slow-downs into opportunities to take on internal projects that boost your business’s resilience. As the work eases up in some part of your business, rechannel your energy into others. <a href=\"https:\/\/www.growwithstudio.com\/blog\/how-to-prune-your-content-for-seo\">Prune your existing website content<\/a> and improve the quality of lackluster pages. Produce new, keyword-rich content that reflects customer needs in the current climate. Scour your top pages for additional conversion opportunities, and audit current strategies and processes. Polishing up your website now will amplify the results of each strategy moving forward.&nbsp;<\/p>\n<p>When people are stuck in quarantine, the healthiest way to cope is by staying connected to our community digitally while using our newfound time to explore a hobby, learn something new, or take on a self-improvement project. Businesses are no different. This is your chance to make a meaningful connection with your community, try a new strategy, or improve your process.<\/p>\n<h2><strong>Design<\/strong><\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/fVnKHQFr1QgzOJvo4zhP6GMZQik7IffE38L_0ZXcOV-A496rrKWxqIb7GjEdRBLIrOwGjj0A1WtAlfabb7HFbcZEgqf_Z-pI9UbxVKq0MoGyDrn4gpQdf73ZLg3jPA\" alt=\"\"\/><\/figure>\n<p>It’s easy to get caught up in day to day tasks and neglect the benefits of periodically checking in on your site and improving its performance. As e-commerce continues to grow each year and competition increases, improving your web design is a great way to grow your business. Here are a few things you can do to improve your site with smart design decisions and strategy adjustments:<\/p>\n<h4><strong>Monitor User Behaviors&nbsp;<\/strong><\/h4>\n<p>Identify problem areas on your website using online resources like <a href=\"https:\/\/www.hotjar.com\/\">Hotjar<\/a> or <a href=\"http:\/\/www.crazyegg.com\">Crazyegg<\/a>. These tools provide insights into user behavior so you can improve your website’s overall user experience and optimize every page for conversions. For example, if you&#8217;re experiencing a high bounce rate or a high percentage of abandoned carts, these tools can help you identify problem areas and drive sales.<\/p>\n<h4><strong>Keep Shoppers Engaged &amp; Up To Date<\/strong><\/h4>\n<p>While design elements such as sticky bars, pop-ups and banners can help immediately capture a user’s attention and simplify navigation, they can also keep visitors updated on changes within your business. Utilize these design elements to stay transparent with site visitors about changes in store hours, out-of stocks, back-in-stock items, shipping delays, and more.&nbsp;<\/p>\n<h4><strong>Update Site Merchandising&nbsp;<\/strong><\/h4>\n<p>Buying behaviors change and your merchandising should too! Update your home page content to showcase the products and services that are most useful to your customers in the current climate so you can immediately appeal to your target audience&#8217;s needs when they visit your site.&nbsp;<\/p>\n<h4><strong>Optimize For Mobile&nbsp;<\/strong><\/h4>\n<p>Most websites see <a href=\"https:\/\/www.broadbandsearch.net\/blog\/mobile-desktop-internet-usage-statistics\">more than half of their traffic come in through a mobile device<\/a>, so it’s important to optimize your site for a positive mobile experience. Nowadays, almost all web hosting platforms offer templates with a responsive design. Having a responsive design ensures that your site automatically adjusts for different-sized screens and viewports. However, a responsive design doesn’t guarantee a positive mobile experience; images can get oddly-cropped in the transition between a desktop and mobile screen. Tools like Google’s free <a href=\"https:\/\/search.google.com\/test\/mobile-friendly\">Mobile Friendly Test<\/a> can help you identify problems, the best way to make sure your site is mobile-optimized is to pick up your phone and use it.&nbsp;<\/p>\n<h2><strong>Marketing<\/strong><\/h2>\n<p>A good marketing strategy is one that is malleable, especially in troubling times. Instead of shutting down your marketing efforts or continuing them as usual, use this time to adjust your marketing strategy to fit your target market’s needs and buying behaviors.<\/p>\n<h4><strong>Know Your Audience<\/strong><\/h4>\n<p>Research your&nbsp;target audience so you can deliver a more tailored message and build a stronger connection with your customers. How have your target market’s priorities shifted? How have their spending habits changed? Has your target audience itself changed? Regroup and find new ways to entice buyers who are no longer in a “buying” mindset.&nbsp;<\/p>\n<p>Don’t forget to nurture existing loyal customers. It costs less to keep an existing customer than it does to win back old ones or acquire new ones.<\/p>\n<h4><strong>Optimize Your Ad Funnel<\/strong><\/h4>\n<p>Analyzing previous ad strategies that have performed best and yielded a high return on ad spend before adjusting your marketing efforts. Continue to build out your <a href=\"https:\/\/www.growwithstudio.com\/blog\/how-to-build-a-facebook-ad-funnel\">ad funnel<\/a> and A\/B test ad campaigns. Testing ads allows you to see what elements of your strategy are working best with your target audience and what areas need adjustments. Don’t be afraid to A\/B test old strategies — when buying behaviors shift, old strategies may perform differently now than they did before.&nbsp;<\/p>\n<h4><strong>Reset Goals<\/strong><\/h4>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/3CY5_7EXGg056Z37Sp8GNYwoNMAONi5WMwImuk-VRV3eQ6eSx5zbXiuq2qZ8CpsOtzY-ACqSiDv04snWwkWhE911DrvKO_segBxLMfzzp7-F4nmF6pAK-LCL5un67Q\" alt=\"\"\/><\/figure>\n<p>When the buyer’s market slows down or slow seasons hit, re-evaluate your long-term business goals and find the small goals that can be set now to help you reach them. Breaking down your goals will help keep them realistic and attainable.<\/p>\n<h4><strong>Think Ahead<\/strong><\/h4>\n<p>Finally, use this down time to align your marketing strategies for the months to come and build out ad funnels for future campaigns. Now is a great time to plan for seasonal and holiday sales that can be stressful to plan during busier months. Proactively optimizing marketing campaigns now will save you time and allow you to shift focus on handling the day to day of your business when the market returns to normal.&nbsp;<\/p>\n<p>When sudden shifts or drops in the buyer’s market happen, remember to keep calm and carry on. While your gut instinct may be to cut back on marketing budgets or stop advertising altogether, this is a huge opportunity to dominate your business’s competitive space. Plant the seeds now to allow your business to flourish in the months to come.&nbsp;<\/p>\n<h2><strong>Social Media<\/strong><\/h2>\n<p>The key to social media success during an economic downturn starts with properly assessing and adjusting your content strategy to reflect the current needs of your target audience. Now more than ever, consumers want to feel connected with brands. Adjust your social strategy to humanize your brand, address buyer pain points, and help bridge the gap between your target audience and business.<\/p>\n<p>Personalizing your content can help strengthen trust in your brand and increase loyalty. Use your social media to update your customers on changes in how orders are processed and notify them of shipment delays, out-of-stock products, and changes in hours of operation. Being transparent and honest about the state of your business will not only help you stand out from your competition but bring in more genuine site traffic to drive conversions.&nbsp;<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/o6r-tpbln3N9n9VWXEFIxNRMg2eaKeQyEigI_ZJ_sdC-dqBwsyxLyEfe52IcwvkEqmttWohi7ZcgnWTxPFwv3cXTddsr15Fq8B8VSxHR1mGf5e5B9DfS8B9sf4DVWQ\" alt=\"\"\/><\/figure>\n<p>Remain consistent and stay active. Consumers are spending more time than ever online. As screen time goes up, this is the perfect opportunity to <a href=\"https:\/\/www.growwithstudio.com\/blog\/best-practices-to-increase-instagram-engagement\">maintain a posting schedule<\/a> that ensures your content gets seen.&nbsp;<\/p>\n<p>Utilize lifestyle content to tell your brand&#8217;s story, show the value your brand brings to the consumer and lets your products sell themselves. Lifestyle content makes it easy for consumers to envision themselves using your products or services while they’re spending more time at home.<\/p>\n<p>Give extra love to your loyal followers. Nurture these leads through your marketing funnel with small buying incentives when possible. Use email marketing to help build on your social media strategy to sustain growth and increase sales. Email marketing works with social media to help you stay connected with customers to deliver the right messages.&nbsp;<\/p>\n<p>If the shift in current buying behaviors has caused a decrease in sales, try to avoid making every post or email blast a direct sales pitch. While it’s important to market your products, social media users and email subscribers don’t want to feel like they’re constantly being sold to. A direct sales pitch can also feel aggressive and spammy if it’s repeated too frequently. Use the visual advantages of social media and email marketing to stay connected with your target audience and nurture them through the buyer’s journey to help increase sales.<\/p>\n<h2><strong>PPC<\/strong><\/h2>\n<figure class=\"wp-block-gallery columns-1 is-cropped\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1024\" height=\"619\" src=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-1024x619.png\" alt=\"\" data-id=\"6690\" data-full-url=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9.png\" data-link=\"https:\/\/www.growwithstudio.com\/?attachment_id=6690\" class=\"wp-image-6690\" srcset=\"https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-1024x619.png 1024w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-300x181.png 300w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-768x464.png 768w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-1536x929.png 1536w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/04\/Write-a-detailed-and-keyword-savvy-pin-description-here-9-2048x1238.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure><\/li><\/ul><\/figure>\n<p>Before pulling the plug on your PPC campaigns, be cognizant of your market and buyer demands. If your ecommerce store has been affected by COVID-19 and you cannot restock or ship your products anymore, now is the time to pause paid search campaigns. However, if you are still shipping products and generating sales, think twice before panic-pausing.<\/p>\n<p>Paid search is the quickest and easiest way to show online users products or services you offer that they are actively searching for. With mandatory stay-at-home measures in place, more consumers are turning to online shopping to meet their consumer needs. As buying behaviour changes, there are things you can do to optimize your paid search campaigns:<\/p>\n<h4><strong>Keyword Optimization<\/strong><\/h4>\n<p>Keyword optimization should be your top priority when it comes to your PPC campaign. The right keywords will help the right people discover your business! Adjust your keywords to fit consumer behaviors by researching them with <a href=\"https:\/\/ads.google.com\/home\/tools\/keyword-planner\/\">Google’s keyword planner<\/a> or <a href=\"https:\/\/neilpatel.com\/ubersuggest\/\">Ubersuggest<\/a>. In addition to keyword optimization, analyze your search queries on a weekly basis. As things continue to change within the buyer’s market, it’s important to make sure the keywords you are targeting remain relevant to your target audience.<\/p>\n<h4><strong>Keyword Cost Per Acquisitions<\/strong><\/h4>\n<p>Now is the perfect time to look over all your keyword’s cost per acquisitions (CPAs). Cost per acquisition is the total cost of a campaign divided by the total number of conversions. Knowing the CPA of your keyword will help you determine your budget and make the most of it. Google uses your past performance, advanced machine learning, and automatic bidding algorithms to calculate the optimal cost per click (CPC) bid for your campaigns. As many small businesses attempt to save money by stopping their PPC campaigns, you might notice reduced competition and lower CPCs.&nbsp;<\/p>\n<p>Dominate your competitive space by optimizing campaigns and pausing expensive keywords that have not increased conversions. This&nbsp;will save you money and help other keywords get a piece of impression share.&nbsp;<\/p>\n<h4><strong>Transparent Ad Copy&nbsp;<\/strong><\/h4>\n<p>Keep your ads up to date and relevant. Ad copy should be clear and concise. Build trust in your brand by being honest about what your business has to offer in relation to what the user is searching for. Do your best to match the verbiage on your ads to the keywords you are targeting, and don’t keyword stuff. Use headline 2 of your ad to mention important buying incentives like free or fast shipping and highlight the other perks of shopping at your store. Don’t advertise out-of-stock products or products that are unavailable due to recent store closures. Consumers won’t buy from a brand they don’t trust, so when all else fails stay honest and transparent.<\/p>\n<h4><strong>Use Promotion Extension<\/strong><\/h4>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/odcs-F6NiT-R9MeMroaWyt2D0X6PUab5D04XsGE2IEzFm5lxt55qJVuXVJS-ca2GaOl-ps_OAzrbxGNf7si5EJlNmJXZJOnHHot4LcmZRxqRt9Ri7hPAPYAKIfuN7A\" alt=\"\"\/><\/figure>\n<p>Although buying behaviors have shifted, people are still shopping. PPC campaigns are the perfect way to help people find your business and meet consumer needs. Utilize the promotion snippet on Google Ads when running sales, promotions or when offering free shipping. This will directly display buying incentives, grabbing the viewer’s attention to drive site traffic and increase sales.&nbsp;<\/p>\n<p>When the buyer’s market changes or the economy takes a downturn and sales start to slow down, it makes sense to adjust your business strategy. Taking a tactical approach, being flexible and staying calm can help you discover new opportunities and realign your goals so that your business stays competitive. If you’re still struggling to maintain business as usual and perfect your business strategy, ask the experts at Studio how we can help you refine your strategy to help you grow!<\/p>\n<div style=\"border:1px solid #eee;\" class=\"margin-top-three margin-bottom-four vdw\"><section class=\"text-center imagebg image--light space--xs\">\r\n        <div class=\"background-image-holder\" style=\"background: url(&quot;https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/01\/lihgtgrey.jpg&quot;); opacity: 1;\"> <img alt=\"\" src=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/01\/lihgtgrey.jpg\"> <\/div>\r\n        <div class=\"container vdw\">\r\n            <div class=\"row vdw\">\r\n                <div class=\"col-sm-10 col-md-10 vdw\"><img src=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/01\/sales-team-min.png\" width=\"180\" class=\"\">\r\n                    <h3 class=\"promo-title unbold margin-bottom-half\">Do you want a <span class=\"bold vdw\">FREE<\/span> website checkup?<\/h3>\r\n                    <p class=\"lead margin-bottom-half vdw\"> We’ll show you how you can increase your traffic and profits, with in-depth recommendations, no automated fluff! <\/p>\r\n                    <a class=\"btn btn--sm btn--primary type--uppercase margin-top-minus-one promo-button\" href=\"https:\/\/www.growwithstudio.com\/checkup\" data-wpel-link=\"internal\"> <span class=\"btn__text\">Get My Free Website Checkup<\/span> <\/a>\r\n                <\/div>\r\n            <\/div>\r\n            <!--end of row-->\r\n        <\/div>\r\n        <!--end of container-->\r\n    <\/section><\/div>\r\n\n","protected":false},"excerpt":{"rendered":"<p>Few businesses are immune to the fundamental economic and lifestyle changes sparked by the COVID-19 crisis. As 52% of U.S. small businesses&#8230;<\/p>\n","protected":false},"author":4,"featured_media":6689,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[219,83,81,67,60,74],"tags":[272,274,268,273],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Adjusting Your Business Strategy For COVID-19 - Grow With Studio<\/title>\n<meta name=\"description\" content=\"Learn about the fundamental strategy changes that small to medium-sized businesses are making to survive the pandemic and how you can apply them to your own business.\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Adjusting Your Business Strategy For COVID-19 - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Learn about the fundamental strategy changes that small to medium-sized businesses are making to survive the pandemic and how you can apply them to your own business.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-14T14:12:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-10T15:52:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/04\/Wordpress-Blog-Featured-Images-7.png\" \/>\n\t<meta property=\"og:image:width\" content=\"3200\" \/>\n\t<meta property=\"og:image:height\" content=\"1200\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"16 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/04\/Wordpress-Blog-Featured-Images-7.png\",\"width\":3200,\"height\":1200},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\",\"name\":\"Adjusting Your Business Strategy For COVID-19 - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#primaryimage\"},\"datePublished\":\"2020-04-14T14:12:00+00:00\",\"dateModified\":\"2020-06-10T15:52:08+00:00\",\"description\":\"Learn about the fundamental strategy changes that small to medium-sized businesses are making to survive the pandemic and how you can apply them to your own business.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19\",\"name\":\"Adjusting Your Business Strategy For COVID-19\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\"},\"headline\":\"Adjusting Your Business Strategy For COVID-19\",\"datePublished\":\"2020-04-14T14:12:00+00:00\",\"dateModified\":\"2020-06-10T15:52:08+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/adjusting-your-business-strategy-for-covid-19#primaryimage\"},\"keywords\":\"business strategy,covid-19 ecommerce,COVID-19 Resources,ecommerce strategy\",\"articleSection\":\"Business Strategy,Design,Ecommerce,Paid Search,SEO,Social\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\",\"name\":\"Studio\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/10\/team3-96x96.jpg\",\"caption\":\"Studio\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/6688"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=6688"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/6688\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/6689"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=6688"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=6688"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=6688"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}