{"id":7282,"date":"2020-08-12T14:22:00","date_gmt":"2020-08-12T19:22:00","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7282"},"modified":"2020-08-12T14:21:35","modified_gmt":"2020-08-12T19:21:35","slug":"email-marketing-101-for-ecommerce-businesses","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses","title":{"rendered":"Email Marketing 101 for Ecommerce Businesses"},"content":{"rendered":"\n<p>Email marketing makes it easier for businesses to stay connected with current customers and build brand loyalty with personalized and relevant messages that drive revenue. Businesses have full control over their email marketing strategy to maximize even the smallest budgets and turn a substantial profit. If you’re wondering how email marketing can benefit your business, we’ve outlined the basics of email marketing to help you get started!<\/p>\n<h2>What Is Email Marketing?<\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/3i18Yzlt8jXnhJ9PXE-IyoJydTyPnPzsYfcv8V5q2JEOmxiKgprey6X63rzMtSMOu35dJDXpgTLoIOBhZc-gmUZC5Nr5l4luo7pgIFz5lfWULv5VmCu96-ZD0CwuC77jPdZgy33W\" alt=\"\"\/><\/figure>\n<p>Email marketing is the most profitable form of direct marketing, capable of generating <a href=\"https:\/\/www.smartinsights.com\/ecommerce\/ecommerce-analytics\/ecommerce-conversion-rates\/\">higher conversion rates<\/a> than social media, direct traffic, and search. With a carefully crafted email marketing strategy, businesses can send commercial messages to targeted customers to increase sales, build brand loyalty, and deliver important information and updates. By sending the right message to the right people at the right time, you can build trust and authority while turning prospects into leads and leads into loyal, long-term customers.<\/p>\n<h2>How Email Marketing Can Help Your Ecommerce Business<\/h2>\n<p>Effective email marketing campaigns can help take small businesses to the next level. Each email your business sends is an opportunity to connect with your customers and show them the unique value your brand brings to them. Your email campaigns should be carefully crafted to solidify branding, establish your brand as a leader within the industry space and appeal to each consumer based on their individual interests and purchase behaviors.<\/p>\n<p>It’s always cheaper to market to an existing customer than it is to acquire a new one. On average, <a href=\"https:\/\/www.campaignmonitor.com\/blog\/email-marketing\/2018\/12\/70-email-marketing-stats-you-need-to-know\/\">for every $1 spent on email marketing, $44 is generated in revenue<\/a>. Email is a cost-effective marketing strategy that gives your business the power to stay connected with customers and stay top of mind. The unique ability to segment your audience for optimized targeting and the personalization of your email content can help you increase brand loyalty and improve sales.<\/p>\n<h2>How to Create an Email Marketing Strategy<\/h2>\n<p>Building a successful email marketing strategy starts with three important elements:<\/p>\n<ol><li><strong>Clearly defined goals:<\/strong> Reaching an inbox shouldn’t be your end goal. Connecting and reaching the recipient is the goal- what does it take to get the viewer to click to open, read the email, and carry out the desired action?<\/li><\/ol>\n<ol start=\"2\"><li><strong>Email service provider:<\/strong> The right email software can help you send emails while also tracking the qualities and behaviors of your contacts; analyze email performance to provide insights on what went well and what didn’t; track deliverability; and optimize send times to make email management easier.<\/li><\/ol>\n<ol start=\"3\"><li><strong>Thorough understanding of full-funnel conversions<\/strong>: Email subscribers engage and interact with your business in various ways across multiple marketing channels. Understanding how your contacts interact with your brand will help you learn where and when email works best.<\/li><\/ol>\n<p>Once you have a clear understanding of your business goals, customer conversion path and have selected the right email provider for your business&#8217;s needs, you can start to build out your email marketing strategy.<\/p>\n<h3>The Significance of Segmentation<\/h3>\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"731\" src=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-1024x731.png\" alt=\"\" class=\"wp-image-7285\" srcset=\"https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-1024x731.png 1024w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-300x214.png 300w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-768x549.png 768w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-1536x1097.png 1536w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-44-2048x1463.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n<p>Segmentation is the division of your list of email subscribers into small sub-categories based on a set of criteria such as purchase history, interests, behaviors and more. Email segmentation is simple and important; it helps you send the right messages to the right people at the right time. At its core, segmentation brings together two crucial inbound marketing concepts:<\/p>\n<ol><li><strong>Buyer Personas: <\/strong>A semi-fictional representation of your ideal customer based on real data and some educated speculation about customer demographics, behavioral patterns, motivations and goals<\/li><li><strong>The Buyer’s Journey: <\/strong>The active research process someone goes through leading up to a purchase. This journey can be roughly categorized into three stages: the awareness stage, the consideration stage, and the decision stage.<\/li><\/ol>\n<p>By focusing on carefully crafted content and copy, you can deliver an email campaign that connects to the buyer persona at each stage in their journey to help drive the desired outcome (sign-ups, conversions, leads, etc).<\/p>\n<h3>The Power of Personalization<\/h3>\n<p>Email campaigns shouldn’t be a cold, distant, robotic interaction. Humanize your emails with more than just the customer’s name. Once you’ve analyzed and segmented your customer list, you’ll have all the information you need to effectively connect with your customers.<\/p>\n<p>Perfecting personalization means tracking user behavior and A\/B testing your strategies. For example, if you send out an email promoting new arrivals at your boutique and the customer opens the email, browses your site, and adds something to their cart but does not complete the purchase, you can send a follow-up email. This email can remind the customer that they have items in their cart while also showing them images of items that they may also be interested in based on their search history and browsing behaviors on your site. The first email sparked interest, the second is to keep your brand top of mind and present the opportunity to not only complete the purchase but also upsell.&nbsp;<\/p>\n<p>By testing out email subject lines, images and email copy, you can determine what connects with the customer so you can improve your emails and maximize your marketing efforts.<\/p>\n<h3>The Impact of Data-Driven Analysis<\/h3>\n<p>Customers are consistently changing the way they live and work to adapt to the world around them. Their Interests and shopping behaviors change, so let your data guide your marketing strategy as you refine your understanding of your customers’ needs and demands.<\/p>\n<p>Tracking your email open rate, click through rate, conversion rate, bounce rate, and the overall number of unsubscribes can help you adjust your strategy to be data-driven. If the metrics are underperforming, apply what you’ve learned through A\/B testing to optimize and improve your email campaign’s performance.<\/p>\n<h2>Types of Emails to Send and When to Send Them<\/h2>\n<p>Before you send out emails, decide on which types of emails are right for your strategy. Setting up the right emails for your subscribers can help you give them what they want, when they want it. When mapping out your emails, here are the best types of emails to consider:<\/p>\n<h3>Welcome Emails<\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/2TkvgZcr1AvLfau5GWGTMTyMjfiLdzQaK6wzc20otMdsRMeWVUtQLUYkCbaDE_oEf0D8JqTFNWOGbJLfZnkp1nPBkBubNT4G2oJTOUlzxE5voVRuPISB_KpAw9GB44DcQYb-Cy98\" alt=\"\"\/><\/figure>\n<p>This the very first email you should send any subscriber to thank them for signing up. It’s also the first time your brand gets to make an impression. Keep welcome emails short, sweet and automated. Automating welcome emails makes sure you never miss the opportunity to connect with new subscribers and can confirm explicit consent to send them emails moving forward.<\/p>\n<h3>Onboarding Emails<\/h3>\n<p>This email should be sent shortly after the welcome email. For this email, ditch the hard sell. Instead, focus on keeping your subscriber engaged. An onboarding email is meant to help you get to know your subscriber and give you an idea of what content they like and insight on their user behavior. Use this email to showcase the value of your brand, provide email exclusive resources or information that help the subscriber get the most out of their new relationship with your brand, provide customer service contact information, and link to social media profiles.&nbsp;<\/p>\n<h3>Newsletter Emails<\/h3>\n<p>Newsletter emails are generally sent once a month and should provide your subscribers with extra value through product reviews, frequently asked questions, blog highlights or even a behind the scenes look at your brand. Not all audiences are receptive to newsletter emails, so &nbsp; do your research to determine if this type of email is right for your business.<\/p>\n<h3>Abandoned Cart Emails<\/h3>\n<p>An abandoned cart email is a follow-up email sent to a subscriber who has added items to their cart and proceeded through a portion of the checkout without purchasing and then left the site. These emails are the cream of the crop, allowing your business to recover lost revenue from low-funnel shoppers. 60% of shoppers who abandon their cart<a href=\"https:\/\/www.digitalcommerce360.com\/2014\/12\/02\/personalized-shopping-cart-abandonment-e-mails-lead-sales\/\"> will return to complete their purchase<\/a> within 24 hours after receiving a personalized email addressing the abandoned items. Use these emails to your advantage to keep your brand top of mind and remind subscribers of items they abandoned and expressed an interest in to drive sales.<\/p>\n<h3>Upsell Emails<\/h3>\n<p>So important it has to be said twice, it’s always cheaper to market to an existing customer than to acquire a new one. Send this email to customers who have made a recent purchase and are likely to make another purchase or upgrade. Highlight promotional content or offers that clearly show the value of the additional purchase and are of the most interest to the customer.&nbsp;<\/p>\n<h3>Transactional Emails<\/h3>\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"731\" src=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-1024x731.png\" alt=\"\" class=\"wp-image-7286\" srcset=\"https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-1024x731.png 1024w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-300x214.png 300w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-768x549.png 768w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-1536x1097.png 1536w, https:\/\/3841ex3t1et33uno5h3thxr7-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/08\/Untitled-design-45-2048x1463.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n<p>The best way to build transparency, authority and trust is with a transactional email. Send this email immediately after a purchase is placed to let the customer know you’re confirming the purchase and are working on shipping out their order. Transactional emails should be used in a sequence, emails are sent at certain triggers or intervals. Once you’ve sent a confirmation of the purchase, send a follow-up email to provide the buyer with a receipt. You can also send follow-up emails when tracking numbers are created, to confirm the item has shipped, to communicate unexpected delays in delivery, and to confirm delivery.<\/p>\n<h3>Special or Limited-Time Offer Emails<\/h3>\n<p>Before sending these emails, segment your list. If you’re offering half off on a product, you’ll want to exclude customers who just bought this item from your mailing list since they paid full price yesterday. Lead these emails with an incentive and a sense of urgency to drive sales and build customer retention.<\/p>\n<h3>Milestone Emails<\/h3>\n<p>Go beyond birthdays and anniversaries; celebrate customer loyalty by extending these emails to include your best customers in a loyalty program. Do your research on the customer’s buying behaviors and know their interests, so you can send special offers that are personalized and relevant to their needs and wants.<\/p>\n<h2>Email Marketing Best Practices<\/h2>\n<p>Email marketing is a great way to turn prospects into loyal customers with carefully crafted content to produce a high ROI. As you start to develop an email marketing strategy that’s right for your business, here are a few best practices that can help you improve your results over time:&nbsp;<\/p>\n<h3>Don’t Buy Email Lists<\/h3>\n<p>Good email address lists aren’t for sale. Buying an email list is a violation of <a href=\"https:\/\/gdpr.eu\/email-encryption\/\">General Data Protection Regulation<\/a> (GDPR) and most email service providers won’t let you send emails to lists you’ve bought. Make sure any list you use has explicit consent, meaning the subscribers have checked a box opting in to receive emails from your business.<\/p>\n<h3>Test Email Rendering Before Sending&nbsp;<\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/t7vmJN7V8XzxkAxbClE5Iu01wZ-VWihf1YrS6wDY1XeToe3sUeZFu7ydyoyl_f23e0KO-j_cLAXfaGGmxe6iHZ2mTMAFRHWpqbp0S5WcamD4KT2KNa9zDGCeSlMFdIfM6dBeKeEO\" alt=\"\"\/><\/figure>\n<p>The last thing you want is to spend hours crafting an email campaign that has broken links, an unresponsive design, or images that don’t load. Do your due diligence and make sure your email renders correctly across all devices. Verify that links work, the design works and is responsive, and double-check for spelling errors.&nbsp;<\/p>\n<h3>Track Important Metrics<\/h3>\n<p>Email marketing can take time to perfect.&nbsp; One of the best ways to improve and optimize your email marketing campaign is to track important metrics such as click-through rate, open rate, unsubscribe, and conversion rate. Understanding how your email performs can help you increase engagement and drive successful conversions.<\/p>\n<h3>Scrub Email Lists Regularly<\/h3>\n<p>Clean your email list every 3-6 months to remove subscribers who never engage with your campaigns. Deleting email addresses on your list who never open, read or interact with your emails can help improve campaign efficiency, open rate and click through rates.<\/p>\n<h3>Include a Call To Action (CTA)<\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/RCBgZnPdd2L2ohmAvrnVKuUaPDpu1_-nNK6vU-UEM9ZJnwRQW1pufb7HFJ6rBePJmUUKIm-2PCH2VyQFdrQaPRA9WrAEmP2k71S6Ue8ZINhU7zyJmQmXngiD5YRfO5HD6VB0fBq0\" alt=\"\"\/><\/figure>\n<p>Encourage your subscribers to complete an action. Test out click-worthy calls to action to get readers to convert. Make sure to be short and clear in your CTA. Use striking, actionable text to draw attention and build urgency.<\/p>\n<h3>Segment your email list<\/h3>\n<p>Segmenting your audience will allow you to divide your list of email subscribers based on criteria such as geographic location, interest, purchase history, email engagement and more. Segmentation allows for better personalization to send the right message to the right person at the right time.<\/p>\n<h3>Write Engaging Subject Lines<\/h3>\n<p>Subject lines serve as your first impression. Considering your audience and the campaign objective, write a subject line that tells your reader the value of the email. Lure your subscribers in with subject lines that connect, to boost open rates and drive conversions.&nbsp;<\/p>\n<p>Email marketing is a powerful marketing tool that can help businesses get to the next level and maximize their marketing dollars. Stay connected with your current customers and generate new leads to help your business grow and drive results. If you’re not sure how to get started with email marketing, the experts at Studio are ready to help!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Email marketing makes it easier for businesses to stay connected with current customers and build brand loyalty with personalized and relevant messages&#8230;<\/p>\n","protected":false},"author":4,"featured_media":7283,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[219,81,330],"tags":[269,332,331],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Email Marketing 101 for Ecommerce Businesses - Grow With Studio<\/title>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Email Marketing 101 for Ecommerce Businesses - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Email marketing makes it easier for businesses to stay connected with current customers and build brand loyalty with personalized and relevant messages...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-12T19:22:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-12T19:21:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/08\/Wordpress-Blog-Featured-Images-3.png\" \/>\n\t<meta property=\"og:image:width\" content=\"2400\" \/>\n\t<meta property=\"og:image:height\" content=\"900\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"10 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/08\/Wordpress-Blog-Featured-Images-3.png\",\"width\":2400,\"height\":900},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\",\"name\":\"Email Marketing 101 for Ecommerce Businesses - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#primaryimage\"},\"datePublished\":\"2020-08-12T19:22:00+00:00\",\"dateModified\":\"2020-08-12T19:21:35+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses\",\"name\":\"Email Marketing 101 for Ecommerce Businesses\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\"},\"headline\":\"Email Marketing 101 for Ecommerce Businesses\",\"datePublished\":\"2020-08-12T19:22:00+00:00\",\"dateModified\":\"2020-08-12T19:21:35+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/email-marketing-101-for-ecommerce-businesses#primaryimage\"},\"keywords\":\"Email Marketing,email marketing 101,email marketing strategy\",\"articleSection\":\"Business Strategy,Ecommerce,Email Marketing\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\",\"name\":\"Studio\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/10\/team3-96x96.jpg\",\"caption\":\"Studio\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7282"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7282"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7282\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7283"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7282"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7282"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7282"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}