{"id":7414,"date":"2020-09-09T12:07:16","date_gmt":"2020-09-09T17:07:16","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7414"},"modified":"2020-09-09T16:34:37","modified_gmt":"2020-09-09T21:34:37","slug":"seo-for-the-food-industry","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry","title":{"rendered":"SEO For The Food Industry: Just E-A-T"},"content":{"rendered":"\n<p>So you’ve carefully sourced your organic ingredients, you have your organic certification, and there are hungry, organic-minded shoppers just waiting to fall in love with your products. There’s only one thing missing: the organic traffic. Fortunately, SEO opportunities are ripe for the picking in the food industry.  <\/p>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/WcRZoYINPx2r82ADiZ8aTUU0zViiqzHH-Qj00r4TsWam3j6_EEJCcIn06tD1fzt9h_q84wLrgKDch-Lo0VOR6GXUsAneAydzrMc_OEkdv_lka9F8S9-w-CmYeec9gbwmKg4wxGFb\" alt=\"\"\/><\/figure><\/div>\n\n<h2>How is SEO Different For the Food Industry?<\/h2>\n<p>While most SEO campaigns cover the same set of core strategies, we can lean into or away from certain tactics based on industry-specific considerations. Within the food industry, unique factors include:&nbsp;&nbsp;<\/p>\n<ul><li>You&#8217;re in a great position to produce fun, vibrant content that targets readers who are passionate about food and cooking.&nbsp;<\/li><\/ul>\n<ul><li>Depending on your niche, thought leadership articles may be less important than they would be in, say, the financial services sector.&nbsp;<\/li><\/ul>\n<ul><li>Because people make food-related searches with such a vast number of goals in mind (information, food to purchase, food to make, etc), you&#8217;ll want to pay extra attention to search intent when you choose your keywords.&nbsp;<\/li><\/ul>\n<ul><li><strong>Trust <\/strong>is everything in SEO. Double down on this truism for the food industry, where customer trust is paramount.&nbsp;<\/li><\/ul>\n<p>Let’s talk about that last factor, trust. In 2018, Google famously unrolled what SEO strategists have coined <a href=\"https:\/\/www.growwithstudio.com\/blog\/google-medic-algorithm-update-recovery\">the medic update<\/a>, an algorithm update that had a disproportionate impact on health and medical sites (hence the name). While the shift took aim at low-quality, irrelevant content across all industries, Google instructed its quality raters to hold “Your Money, Your Life (YMYL)” sites to higher page quality standards.&nbsp;<\/p>\n<p>As defined by Google, a YMYL site is any page that could impact the user’s “current our future well-being (physical, financial, safety, etc).” This includes blogs doling out advice about money and health, along with ecommerce websites in the finance or healthcare industry.&nbsp;<\/p>\n<p>Why do we care about this? Because there’s significant overlap between the food and the healthcare industries, depending on what you sell. If you sell health food or other products geared toward helping people live a healthier lifestyle, your content may spill over into YMYL territory. Hold your content to the extra scrutiny warranted for the subject matter, staying on high alert for medical claims and anything that might be construed as medical advice.&nbsp;<\/p>\n<h2>E-A-T for SEO&nbsp;<\/h2>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh4.googleusercontent.com\/SdeA0c1sdYXLCuMh4LLZf92AThOhKD-7K81dK8BQ7KX1WdwUUbPbWZ5dt1TI1J9RpXYxpxwn83QukQSMDgZFnZR5yq7EMxZbq6FlESWAWfEvRq4TBhJQaBzj6nKFIvE6O2iS2KZm\" alt=\"\"\/><\/figure><\/div>\n<p>To sum up the factors desired from a great piece of content, Google devised an acronym that happens to be especially memorable for those in the food industry: <a href=\"https:\/\/moz.com\/blog\/eat-and-the-quality-raters-guidelines\">E-A-T (Expertise, Authority, Trust)<\/a>. According to Google, trustworthy content demonstrates:&nbsp;<\/p>\n<ul><li><strong>Expertise <\/strong>&#8211; Does the person or brand behind the content have expertise in the subject? How is that made clear? Is the content written with the depth and accuracy that you’d expect from a subject matter expert?&nbsp;<\/li><\/ul>\n<ul><li><strong>Authority<\/strong> &#8211; It’s one thing to <em>be <\/em>an expert, but how do people <em>know <\/em>you’re an expert? Authority is typically the byproduct of expertise: after consistently demonstrating your expertise in a subject, people start to view you as an authority in that space. That said, there are things you can do to help the perception along. It’s just like in real life: you could be the world’s leading expert on a subject, but if you don’t spend time building your reputation, nobody will know that.&nbsp;<\/li><\/ul>\n<ul><li><strong>Trust<\/strong> &#8211; Finally, how trustworthy is your website? Expertise and authority clearly boost trust, but additional design and development considerations can reinforce (or detract from) trustworthiness.&nbsp;&nbsp;<\/li><\/ul>\n<p>Using E-A-T as our lense, let’s look at how we can adapt the individual components of the SEO strategy to fit the food industry.&nbsp;<\/p>\n<h2>Technical SEO for Food Ecommerce&nbsp;<\/h2>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh5.googleusercontent.com\/_tBwQu8WCjdsjjRyjd_gwesqxDrDpKfxzqa2FC2zlTg3TXzB3e6QloRDb5u9irQU0FUjeVJg7QzH7ZFBI1VYNh3VkdR5F6Js-tJG1Uhe9pCvyXwGLJnyTEgsRYCl2Z8JfaFYGx9p\" alt=\"\"\/><\/figure><\/div>\n<p>Technical SEO is like a fingerprint: every website has a different set of technical SEO needs, discoverable only through auditing the specific site. That said, websites across the board should stay hyper-aware of the following technical factors:&nbsp;<\/p>\n<ul><li><strong>HTTPS Protocol<\/strong> – The difference between HTTP and HTTPS protocol is what that <em>S<\/em> represents: Secure. HTTPS means all data and communication between the user and the website is encrypted. That’s a must when you’re transferring credit card information and other forms of personal data, and Google thinks so too. HTTPS is a “ticket to ride” ranking factor: using it won’t guarantee top rankings, but <em>not <\/em>using it is an almost certain path to substandard rankings. Secure websites are trustworthy, and that moves us a little closer to our E-A-T ideal.&nbsp;<\/li><\/ul>\n<ul><li><strong>Speed <\/strong>&nbsp;– According to Google’s own research, an increase in page load time from one second to three seconds <a href=\"https:\/\/www.thinkwithgoogle.com\/marketing-strategies\/app-and-mobile\/page-load-time-statistics\/\">increases the probability of a bounce by 32%<\/a>. And the bounce rate only grows more dire as the seconds count up from there. A speedy website won’t just help your organic rankings; it will impact your bottom line directly by keeping more visitors on the page. It’s also another way to increase user trust. We might not consciously think about it, but when we leave a slow-loading website we’re not just being impatient. Our trust in the website and browsing experience diminishes as the seconds count off.&nbsp;<\/li><\/ul>\n<h2>On-page SEO for Food Ecommerce Sites&nbsp;<\/h2>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh6.googleusercontent.com\/2p5IOwC0CO6vq6Bp0g7A8PeVLu6ihebSayfx26m5Rke2aOdV02JUa_SuoVEe_rqIxVIupoN6_3iS1ebhFWBZN95J8ThGEpGJS48Td13PNn26T9vSrFL7WA5k2S9kzSoIyw-E9G49\" alt=\"\"\/><\/figure><\/div>\n<p>One of the reasons so many SEO strategies start with on-page SEO is because the cost\/benefit is so favorable. Compared to spending 20 hours on a single piece of content or toiling away building links, the potential return for your on-page efforts is relatively well-defined (which isn’t to say you shouldn’t spend time on content and links! Those strategies are just more ongoing and incremental).&nbsp;<\/p>\n<p>While every strategist has their own secret sauce, typical on-page strategies consist of:&nbsp;<\/p>\n<p><strong>Keyword Research<\/strong> – For every page, select 3-5 keywords that are ideally suited to the page. Start by brainstorming a list of keywords you find relevant for the page, then use a tool like Ahrefs or Google’s Keyword Planner (if you have a Google Ads account) to expand your list. Your preferred keyword research tool will be able to automatically generate hundreds of additional ideas based on what you feed into it.&nbsp;<\/p>\n<p>Download those keywords and their corresponding search data into an Excel file, deleting columns as needed and keeping: monthly search volume, competitiveness or difficulty score, and overall opportunity score (if your tool provides one). Keyword Planner won’t give us the kind of detail we need for search volume, so switch to your preferred keyword research tool for this part. We like Ahrefs, Moz Pro, SEMRush, and Majestic.&nbsp;<\/p>\n<p>What you’re looking for here is an optimal combination of search volume (high), competition (low), and relevance (high). Make relevance your top priority; a great keyword opportunity isn’t so great if it doesn’t actually fit the page.&nbsp;<\/p>\n<p>On that note, we mentioned earlier that search intent is an extra consideration for the food industry. Food-related queries meet many different types of needs, from transactional (“I want to buy salsa online” to navigational (“I’m looking for taco restaurants”) to informational (“I want to learn how to make the best salsa”). Make sure the page you’re serving meets the needs of the query; if someone needs a recipe, it’s not helpful to offer them a product page.&nbsp;<\/p>\n<p>When in doubt, Google your intended keyword and note the top results. Those are good indicators of the type of page that meets the search intent.&nbsp;<\/p>\n<p><strong>Title Tags<\/strong> – Title tags greet the user in the search results, and they’re essential for helping Google (and the user) understand and organize the page. They’re also primo territory for your selected keywords to shine.&nbsp;<\/p>\n<p>In 60 characters or less, describe what the page offers to the user. While you should strive to keep your title tag keyword-rich, gone are the days when you could stuff a title tag full of keywords and call it a day. Today’s title tags are user-first. They contain keywords, but they may also include enticing adjectives or other information that may be helpful for the user. For example, here’s the top result for the search “buy salsa online:”&nbsp;<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/8pBlUvEJKW9hRXAb1CpZgPRZ6auuvupRvLPnJxDQYS54VTNFghHjfthEDuUplGlKjdwqV3TwVSIuUle6Ug--TTg9Gkegjtp-czks2-dNm7K3QbhtXrRwWJ83vucvVk81IO9UqDW7\" alt=\"\"\/><\/figure>\n<p>Now, this meta data isn’t perfect – both the title tag and meta description are too long, so they cut off in the SERPs – but one thing we do like is the inclusion of “Over 1500.” That’s clearly not one of the site’s keywords (nobody searches for 1500 salsas), but it’s a modifier that doesn’t take up a lot of real estate and packs a powerful punch.&nbsp;<\/p>\n<p>In just ten characters, we’ve learned something important about this shop: they don’t just sell salsa, they sell <em>tons <\/em>of it. If we’re looking for variety, this is our shop. Even if we aren’t, that extra piece of information helps us trust in the shop’s expertise (not many places would sell 1500 super-specific products without learning something about it).&nbsp;<\/p>\n<p><strong>Meta Descriptions<\/strong> – Appearing just under the title tag in the SERPs, meta descriptions are a guide for the user. Including keywords in your meta description won’t impact your rankings, but they do get bolded in the text when they match part of the query (in our example above, Salsa). In 160 characters or less, write a description that entices the user to click on the result.&nbsp;<\/p>\n<p>In our example above, we love the overall relevance of the description and the inclusion of the word “remarkable.” We would modify it by removing “jellies, soups, dips, bread and…” which will give us enough room to add a call to action or incentive like “order now for free shipping!” If our CTA needs more space, additional ways to pare down what’s there include changing “over 1500” to “1500+” and replacing the word “including” with a colon (“&#8230;1500+ southwest specialty foods: salsas, hot sauces&#8230;.”). If we’re really hurting, we could change “selection” to a shorter word like “line,” and abbreviate “southwest.”&nbsp;<\/p>\n<p><strong>On-Page Content<\/strong> – Your keywords will also feature in your on-page content. And since you can write the amount of content that meet’s your page’s needs, your keywords are easier to work in. Try to hit on each keyword once or twice, depending on the length of your copy.&nbsp;<\/p>\n<p>Again, write primarily for the reader – not Google. If you’re having trouble working a keyword in naturally, don’t force it. Instead, simply focus on the copy that tells your story best and humanizes your brand.&nbsp;<\/p>\n<h2>Content Strategy for Food Websites&nbsp;<\/h2>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/BwewgcPPdSUQURF0TVXgtu1Xdxap2wo9GoTTlElrzqpGRGFfqsERrwsqA-uMqkNCIYYP6WLxTnC509Rl_FL-vwuAcbUjuAz0Zpn_0N8LXv8030oHcVzr80Y_5i0KhgKTfGEYmtDT\" alt=\"\"\/><\/figure><\/div>\n<p>Many of our strategies so far have focused on building up the <em>T<\/em> in E-A-T, trust. While our content will build trust too, it’s also where we build up the <em>E<\/em>, our expertise.&nbsp;<\/p>\n<p>It’s also the place where we get to have some fun! By regularly offering content our audience will love, we reinforce our expertise and helpfulness while we keep the conversation with our customers fresh.&nbsp;<\/p>\n<p>If you’re tight on resources, there’s nothing wrong with using your blog as your primary mechanism for communicating with your customers. We call that format “[short\/long] blog posts.” Additional formats that are great for your industry include:&nbsp;<\/p>\n<ul><li>Guides&nbsp;<\/li><li>Ebooks&nbsp;<\/li><li>Recipes&nbsp;<\/li><li>Shopping lists, checklists and other downloadables&nbsp;<\/li><li>Videos&nbsp;&nbsp;<\/li><li>Photo essays&nbsp;<\/li><li>Webinars or classes&nbsp;<\/li><li>Cooking playlists to share on Spotify&nbsp;<\/li><li>Menu planners&nbsp;<\/li><li>User-generated content&nbsp;<\/li><li>Food- or health-related infographics&nbsp;<\/li><\/ul>\n<p>As for the subject matter, it’s hard to give universal advice because the food industry encompasses so many possible verticals: recipe websites, grocery stores, single-product stores, shops that focus on a niche like gluten-free products, health-related shops, and more. Subject matter and content varies vastly between verticals.&nbsp;<\/p>\n<p>Once you identify your audience, find the communities they participate in and the content they read. This might include competitor blogs, general industry blogs, Facebook groups, influencers, and more. The more you can immerse yourself in this content and community, the better. Over time, you’ll get a feel for what’s on their mind, what’s keeping them talking, what questions or needs come up frequently, what their biggest pain points are, and more. Addressing what your audience cares about with your own content is the perfect way to connect with them.&nbsp;<\/p>\n<p>As you build out your content, look for opportunities to maximize or repurpose it. Everything you produce will involve some frontloading – time spent choosing and researching the topic – and when you repurpose content, you cut out the front-loading for everything but the initial piece. Turn blog posts into videos that summarize the content. Turn recipes into video tutorials. Combine related topics into an ebook. Add bold, beautiful graphics to your posts and share them on social media. For every piece of content you produce, challenge yourself to come up with five ways to expand its usefulness.&nbsp;<\/p>\n<h2>Linkbuilding in the Food Industry&nbsp;<\/h2>\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh6.googleusercontent.com\/ZLl0zPKsgOJKWgBVJEQ90Pp2PgEK4v8taUi9n02DanlI3_216mEv9QwbmeWDH5D9SwXET5mD353-PeVCoTt3OiFblKZ6bCVshxUwOCiN8kaZgGYuDVMb_1-bw6eVNZEmffwUxKV-\" alt=\"\"\/><\/figure><\/div>\n<p>Like your content, your individual go-tos for boosting authority will vary according to your industry. However, there are also opportunities that are a great fit for your industry across the board. These include:&nbsp;<\/p>\n<ul><li><strong>Grassroots blogger outreach<\/strong> &#8211; Unlike an electronics manufacturer or high-end jeweler, you’re likely to have products in your arsenal that are affordable and shipping-friendly enough to give away for free. Lucky you! Offering products to bloggers and influencers in exchange for an honest review can swiftly help you connect with new audiences and boost your off-site authority.&nbsp;<\/li><\/ul>\n<p>Just remember to do your due diligence and make sure each blog is active and well-trafficked (Ahrefs and SpyFu are both good tools for this). A link from a blog with one reader is a waste of time at best. At worst, you’ll actually hurt your authority by sending links from spammy or low-quality websites.&nbsp;<\/p>\n<ul><li><strong>Influencer marketing<\/strong> &#8211; When in doubt, go straight to the influencers. If they’re in high demand and you have no prior relationship with them, they&#8217;ll require compensation beyond the free product. This is generally worth it as long as you’ve verified that they really are an influencer within their community. From an SEO standpoint, a link from sponsored content or social media won’t help you directly. However, it can create a cascading effect by sending engaged traffic to your website and getting other people talking.&nbsp;<\/li><\/ul>\n<ul><li><strong>Contribute guest posts<\/strong> &#8211; Food-related websites rely on user-contributed content more than almost any other vertical. You should be able to spot plenty of opportunities to share resources, recipes and articles with your community as a guest author. As you weigh your options, try not to fixate on how the link itself with help your SEO – this will put you on a fast track to ignoring some great opportunities and paying too much attention to websites that won’t send meaningful traffic. Instead, think about whether the blog’s audience will appreciate your content, and whether there’s overlap between the blog’s target market and your own. The most valuable links are the ones that send active, engaged traffic, so think user behavior first.&nbsp;<\/li><\/ul>\n<h2>Going the Extra Mile: Trust Boosters&nbsp;<\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/r5owwWufI_m8dL-iWM1aBewg7I5paDG9zFgCPXzXoXMG5ddceSmfSlpZ7-mxrKHQCf9PLlZxm6dKicPZ9J4PhHBEbfE3vFrvDdx8yDjXufOFEypjQMcYYhuI0erhj63ccgQCuNsC\" alt=\"\"\/><\/figure>\n<p>Many of the strategies we’ve discussed so far will naturally increase user trust – but they rely on content and long-term engagement. Go the extra mile by adding design elements to your site that will show people <em>at a glance<\/em> that your brand is trustworthy. Ideas include:&nbsp;<\/p>\n<ul><li><strong>Testimonials <\/strong>&#8211; Testimonials from happy customers go a long way, so add a section to your site or intersperse quotes throughout your design. If you’re working with an influencer, let their endorsement do double duty by featuring it prominently on your website.&nbsp;<\/li><\/ul>\n<ul><li><strong>Product Reviews<\/strong> &#8211; Product reviews might not always tell the fully-formed story testimonials can tell, but they’re a better indicator of how <em>many <\/em>people feel – not just the few customers you hand-picked for a testimonial. If your customers can’t stop giving you five-star reviews, share it loud and proud. Put together a strategy to solicit and incentivize reviews so you have lots of ammo.&nbsp;<\/li><\/ul>\n<ul><li><strong>A “Featured In” section<\/strong> &#8211; If you have positive mentions from major names, add their logos to your site.&nbsp;<\/li><\/ul>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/hBtZsNG-uiVc0xauLFpoSnZvt9RQkz_ztMZtZdL8uMRkxGpjwdjCekPXSSv5uoO8Oi2Mia5tnzGhvYsEf-d4ZVMNqQLCQciVC1yjg3MWXdWSto3ylHDkWwnYCoaHWP9MJSkSG2Mz\" alt=\"\"\/><\/figure>\n<ul><li><strong>Trust Icons<\/strong> &#8211; Trust icons are quick graphical elements that summarize what makes you special. For example, here are ours at Grow With Studio:&nbsp;<\/li><\/ul>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/c9RSLhE1o2puLt0YDQxaP2FRANbnupKTdkSUuV4P7UiNkiTPVS6BheMyZaVnlGfY2_EdZvedORNyj_8RhqRjFQ3ucyLDTjFgojogXSYytvaKwZQufpgMe1Ahz6YXXk0dg3OloxR1\" alt=\"\"\/><\/figure>\n<p>Food websites can use trust icons to great effect. Think about the value you create for your customers – from organic ingredients and local sourcing to a money-back guarantee – and turn your top differentiators into simple, visually-pleasing icons.&nbsp;<\/p>\n<p>Last but not least, have fun! Like any culinary master, your passion for what you do will shine through. Play, engage, experiment, and take every opportunity to remember why you love what you do. And if you need any help, we happen to <a href=\"https:\/\/www.growwithstudio.com\/yum\">love food<\/a> at Grow With Studio. Check out our <a href=\"http:\/\/food ecommerce guide\">food ecommerce guide<\/a> or give us a shout!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So you’ve carefully sourced your organic ingredients, you have your organic certification, and there are hungry, organic-minded shoppers just waiting to fall&#8230;<\/p>\n","protected":false},"author":33,"featured_media":7416,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[60],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>SEO For The Food Industry: Just E-A-T - Grow With Studio<\/title>\n<meta name=\"description\" content=\"You have the organic products, but what about the organic traffic? Serve your food ecommerce site up to hungry searchers with these SEO tips.\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"SEO For The Food Industry: Just E-A-T - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"You have the organic products, but what about the organic traffic? Serve your food ecommerce site up to hungry searchers with these SEO tips.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-09T17:07:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-09T21:34:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/09\/orlova-maria-0e7zpLLKSzA-unsplash-scaled-e1599671474497.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"14 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/09\/orlova-maria-0e7zpLLKSzA-unsplash-scaled-e1599671474497.jpg\",\"width\":2560,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\",\"name\":\"SEO For The Food Industry: Just E-A-T - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#primaryimage\"},\"datePublished\":\"2020-09-09T17:07:16+00:00\",\"dateModified\":\"2020-09-09T21:34:37+00:00\",\"description\":\"You have the organic products, but what about the organic traffic? Serve your food ecommerce site up to hungry searchers with these SEO tips.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry\",\"name\":\"SEO For The Food Industry: Just E-A-T\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\"},\"headline\":\"SEO For The Food Industry: Just E-A-T\",\"datePublished\":\"2020-09-09T17:07:16+00:00\",\"dateModified\":\"2020-09-09T21:34:37+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/seo-for-the-food-industry#primaryimage\"},\"articleSection\":\"SEO\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\",\"name\":\"Meg Nanson\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/02\/meg-nanson-96x96.jpg\",\"caption\":\"Meg Nanson\"},\"description\":\"Meg Nanson is Grow With Studio's Content Strategist and Wordsmith-at-Large. She comes fully-equipped with 8 years of experience in content strategy &amp; SEO, and has helped businesses of every size find their voice and scale their organic strategies.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7414"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7414"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7414\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7416"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7414"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7414"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7414"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}