{"id":7471,"date":"2020-10-01T16:30:48","date_gmt":"2020-10-01T21:30:48","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7471"},"modified":"2020-10-21T09:46:30","modified_gmt":"2020-10-21T14:46:30","slug":"ecommerce-product-page-seo","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo","title":{"rendered":"The Definitive Guide to Ecommerce Product SEO"},"content":{"rendered":"\n<p>Want to bring more high-intent visitors directly to the products they’re looking for? Then it’s time to refresh your product page SEO.&nbsp;<\/p>\n<p>Your product pages are the most specific transactional pages on your site, and they bring in traffic at the very bottom of the sales funnel – by this point, the all-important “Add to Cart” button is the only goal remaining. And while they’re more likely to rank naturally for the product keyword, that’s not a guarantee – nor are you necessarily using the most popular or competitive version of the product keywords.&nbsp;<\/p>\n<p>It’s common for on-site SEO strategies to shuffle most of their allocated time to optimizing the home page, category pages, and other pages near the top of the site architecture. That’s perfectly understandable; those pages are more likely to target high-volume, big-ticket keywords that introduce new shoppers to your brand. But when you assume your product pages don’t need <em>any <\/em>SEO love, you miss out on an opportunity to attract valuable low-funnel traffic to your site.&nbsp;<\/p>\n<h2>Ecommerce Product SEO Best Practices<\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/HNXO-E3X3A0lUrJbk54JlcB_YU6uVTxm7pcgl_DSxd9o2lo-DflAKXoy-6EEDR6LWDP2wA7Pmpegi52kg_KceDV99n3D2KI6IEaYGF1LRpfdGh8KzqkeMZ5jg-9nbp5bM2jJxef0\" alt=\"definitive guide to product page SEO - Grow With Studio - Ecommerce Marketing\"\/><\/figure>\n<p>Optimizing your product pages does two things: first, it gets the page ranking for relevant, purchase-driven keywords. Next, it provides your human visitors with all the information they need to make a confident purchase decision.&nbsp;<\/p>\n<p>When we optimize ecommerce product pages, we focus on the following elements:&nbsp;<\/p>\n<ul><li>Keywords &#8211; How are people searching for the product? If your title tags auto populate with the product name, is that the optimal search term?&nbsp;<\/li><li>URL &#8211; Is your URL short, user-friendly and descriptive? Does it contain product keywords?&nbsp;<\/li><li>Meta Title &#8211; How might you rewrite your title tag to better prioritize keywords, accurately describe the page, and entice visitors?&nbsp;<\/li><li>Meta Description &#8211; Does your meta description sell the product and entice people to click?&nbsp;<\/li><li>Header Text &#8211; Is your H1 written for people <em>and <\/em>search engines?&nbsp;<\/li><li>Product Description &#8211; Do your customers have all the information they need to make their decision? Do you prioritize the content people want to read first, while included access to additional details, specifications, and FAQs if necessary?&nbsp;<\/li><li>Product Image &#8211; Are your product images high-quality and high-resolution, displaying the product from multiple angles?&nbsp;<\/li><li>Product Image Alt Text &#8211; Do your photos include alt text describing each picture so your vision-impaired readers can understand your images?&nbsp;<\/li><\/ul>\n<p>Ecommerce product pages can also include customer reviews, apparel size charts, demonstration or unboxing videos, related products and upsells, and more.<\/p>\n<h2>Keyword Guidelines for Product Page Optimization<\/h2>\n<p>The goal of a product page’s URL, meta tags, image and description is to convey why the page exists on the site and what sets it apart from other products. Its primary way to do this is through its keywords.&nbsp;<\/p>\n<p>Logically, those keywords will almost always include the product name; relevance is key in SEO, and there’s nothing more relevant than the exact product the user (and Google) can expect. This is why product pages often fall to the bottom of the SEO optimization pile when it’s time to prioritize workflow. There’s a limited range of keyword options for a product page when compared to, say, a category page for women’s pants. Because of that tight range, you don’t have the same huge range of search volumes to compare. That makes your job much easier, and it makes automations like auto-populating your title tag a breeze.&nbsp;<\/p>\n<p>That’s also what causes people to prioritize product pages on their list of optimization strategies, to the detriment of the page. Dive into your product page keyword research and you may uncover some surprising finds. There’s a limited range of choices, yes, but those choices can still vary wildly in search volume and competitiveness depending on how people are searching.&nbsp;<\/p>\n<p>To start your product page keyword research process, build a list of two- and three-word phrases that accurately describe the product. This is your “seed list” that you’ll feed to the keyword research tool(s) of your choice (we like Ahrefs and Moz) so you can expand your list into more options and see data for each keyword. Because our tools will give you more ideas later, all you need now is a well-rounded, comprehensive list of every product-related keyword you can think of off the top of your head.&nbsp;<\/p>\n<p>Keyword ideas can include the following:<\/p>\n<ul><li>The manufacturer’s product number<\/li><li>Product make<\/li><li>Product model<\/li><li>Year<\/li><li>Length and width options<\/li><li>Product materials<\/li><li>Alternative names for the product&nbsp;<\/li><li>Additional differentiators, if applicable: who it’s for, what problem it solves, where it was made, etc&nbsp;<\/li><\/ul>\n<p>Whatever factors make this product warrant its own page should be included on the page’s description and within its vital SEO fields. That said, you may discover through your keyword research that people aren’t searching for your product exactly as you anticipated. Let’s say you sell hardware and the product page keyword in question includes the product’s length and width. If your keyword research reveals that people don’t search for the length and width, but instead rely on more general search terms so they can filter their specific choices later, then you have the chance to work with a more succinct, high-volume keyword.&nbsp;<\/p>\n<p>The differences don’t have to be that granular, either. Let’s say you’re a bath and body shop and you’re wondering which keywords to assign to a lavender-sage shower gel. Your keyword research can answer questions like:&nbsp;<\/p>\n<ul><li>Do more people search for “shower gel” or “body wash?” Since the two words are interchangeable, you have the freedom to use the more optimal term in your product titles and descriptions.&nbsp;<\/li><li>Do people search for “lavender shower gel” or “lavender-sage shower gel?”&nbsp;<\/li><li>If they search for neither, what about terms like “relaxing shower gel,” “herbal shower gel,” or “aromatherapy shower gel?”&nbsp;<\/li><\/ul>\n<p>While it’s okay to include some broader keywords on product pages, don’t prioritize generic terms. Ecommerce sites generally move from broad categories and keywords to more specific pages, and the keywords on each page should reflect the level of specificity. Using non-descriptive keywords on a product page will only confuse search engines and prevent the page ranking for very specific customer searches, which generally have the highest conversion rate.<\/p>\n<h2>How To Optimize a Product Page: The Basics<\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/bBVSYiEy71e8liiA9pRNDg2XAmSZ6ILsyy2YOr6Kds2Zv276olmbLX-CldCL7VO5eAcZGCI9JTGlRcDHi0kRraWLJrUzAit8rd75AowwThVPXhSw8knLnLzFrplfVe0EFQrLsV_g\" alt=\"optimize seo\"\/><\/figure>\n<p>The best product pages blend optimization for human shoppers and search engine crawlers. Fortunately, you start with the same question either way: how can I make this page as useful and relevant as possible for the keywords I’ve chosen?&nbsp;<\/p>\n<p>With that in mind, optimize the following fields for your keywords:&nbsp;<\/p>\n<h3><strong>The Product Page URL Text<\/strong><\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/LozsbQA-6RD84vBoa4OUNXDKIGnBJlGROZVeF6XtJGIuFW4YHJxI69Lype2cmfkTCaemiFKLoCzf1Vtcfz38Xt4lzj7kP6m9kiGeCd2R3yZ61Jj_lTjqDvg6c_iON1gJUYJpnnBB\" alt=\"product page URL text SEO for ecommerce\"\/><\/figure>\n<p>A concise tag that’s included in the official product URL is ideal for product page URL optimization. Aim for accurate, descriptive, and keyword-rich – but not keyword-stuffed. Usability takes priority here, so make sure your URLs are concise and helpful for the user.<\/p>\n<p>Don’t overthink these; usually, your most appropriate option is the product name. You may decide that a color or material option should be added to the product name to further define the product page URL. If your URL is pulling a lot of extra info you <em>don’t <\/em>need, though, like the SKU, URL optimization gives you a chance to pull the clutter out of your URL (most platforms will automatically redirect URL changes to the new version, but double-check yours).&nbsp;<\/p>\n<h3><strong>Meta Title Tag<\/strong><\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/R3jBMqpAialXSr5DjWFj6q3vvT_N02PObD1yR9iWAYOwxIfaAk6kHqIxuGKBkMTrsf3j11uZHWEmobHdg2qOcTCl-LHYdvK97hg8jsg3oM3cFDTjHLgNzdxSHQDPVSH3esWPQo1S\" alt=\"product page title tag SEO for ecommerce\"\/><\/figure>\n<p>The title tag is the overarching title for each product page. While the title does not appear to the customer on the page itself, the first 600pixels (50-60 characters) of each tag render on the top blue line of a Google search result and impacts the page’s rank.<\/p>\n<p>Make sure the product details are communicated in this field and can be understood by a human reading from left to right.&nbsp;<\/p>\n<p>It’s usually best to start with the product name and include additional product features or attributes. No need to go overboard and list every product option or feature; instead, prioritize what makes the product unique in the title tag field. While keywords are important here, don’t be afraid to add a little extra pop with adjectives like “beautiful,” “tough,” or the desired quality that best fits your product.&nbsp;<\/p>\n<h3><strong>Meta Description Tag<\/strong><\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/jpqeESNzwhGBJAHrpnmylK52I-8wGuMOp_H45jQNw2-0hQC322hRPG8uGVUg0IFhOt9m_RuOGoyjnnXRpiZqVYBHVIGErkXKtsKYCogGW0fn6dSHp-OZVrCk23Qd_fcq0iCa-RFE\" alt=\"product page meta description SEO for ecommerce\"\/><\/figure>\n<p>The meta description is instead displayed under the meta title in the search results. Unlike the title tag, meta description keywords are <strong>not <\/strong>a direct ranking factor. They do, however, get bolded in the search results if they match what the user searched for.&nbsp;<\/p>\n<p>Primarily, though, they’re for the user. If we pretend our ten search results are ten coffee shops lined up in a row, your meta descriptions are the billboard that entices customers to shop with <em>you<\/em>. Write for clicks.&nbsp;<\/p>\n<p>In one or two short sentences, make the case for why the reader should click on your link. Highlight the product’s best or most important features, and include extra incentives like “Free Shipping” that encourage customers to shop. This field is truncated after 920 pixels (between 120-160 characters), so make a quick, strong case for the product and include a call to action.&nbsp;<\/p>\n<h3><strong>Product Description (On-Page)<\/strong><\/h3>\n<p><img loading=\"lazy\" alt=\"example of an optimized product page description for ecommerce SEO\" src=\"https:\/\/lh3.googleusercontent.com\/vdjF4cM08VEBWyMCOkCUvbe3nv9kZkHPGnNgMM7vNEGw6MLAF-p00sB3tkTgrkNQ3aiqhxtJoIVoZgA5KKnYE5dKBdqZJE2ICMptnT7OVtGvQsNV9RPwIzfXELMThYIdDCkxhBxE\" width=\"624\" height=\"191\"><em>Product Description from Manly Bands’ “<\/em><a href=\"https:\/\/manlybands.com\/products\/the-gentleman-1\"><strong><em>The Gentleman<\/em><\/strong><\/a><em>” ring.<\/em><\/p>\n<p>Now we move to the product page itself. Incorporate your product keywords as naturally as you can into the on-page content, prioritizing readability first. It <em>should <\/em>feel natural to include your product keywords; if it doesn’t, that may be a sign that the keywords you chose aren’t enough.&nbsp;<\/p>\n<p>Focus your content on selling the product, mentioning its specific value propositions and benefits.&nbsp;<\/p>\n<p>Questions to answer in the description include:<\/p>\n<ul><li>What does this product offer that’s unique?<\/li><li>How does this product make the customer’s life better?<\/li><li>Are there features included that the competition doesn’t have?<\/li><li>What unique incentives does your store offer?<\/li><\/ul>\n<p>Remember, each product page needs to make a clear case why the shopper should buy your product. Use the language your customers use, nixing technical language and industry jargon if possible.&nbsp;&nbsp;<\/p>\n<p>That said, sometimes your customers need those technical specifications before they can make an informed purchase decision. That’s why many ecommerce product pages include primary and secondary product descriptions. Your primary description is the product’s “ad,” so it’s where you’ll get to the point and answer the questions above. Secondary product descriptions, which appear in a lower-priority place somewhere under the main description, let you cover all the extra nitty-gritty information your customers need. Depending on how much of this information you have, you might make additional UX-driven choices like moving some of the content behind tabs.&nbsp;<\/p>\n<h2>Advanced Product Page SEO Tips<\/h2>\n<p>While your content and meta data are your primary places to shine for Google, you do have additional opportunities to highlight your products for your customers and the search engines.<\/p>\n<h3><strong>Product Photo Optimization<\/strong><\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/pQNjuqXjBt-u-kwpfqPPWXZ3Ap43mNFXP5nuT4NrR2xqoEQfhFJ-hNl2zwGFBfy4HPAy949W4AT8sFv85FfZtHWaXCpJrcIkAUwte8XnoHp3YtjAYIn-9JyfNRZt8YvWZKvkxvtO\" alt=\"optimized product photos for SEO\"\/><\/figure>\n<p>The main product photos and additional images are often what your customers see first, and they can boost your brand and help shoppers better understand your product. Use high-quality, high-resolution photos that help the customer understand the product in as much detail as possible. Feature the product from multiple angles, add close-up shots, and show the product in use. You could even add some lifestyle photos to help your customer “see” the product fitting into their own life – or even their ideal life.&nbsp;<\/p>\n<p>In order to get the most out of your images, accurately name your image files using plain English or the manufacturer’s product code. Reinforce the image file with a photo alt tag that describes what the product is. Because these photos are pretty straight forward, it’s okay to just use the product’s name or title tag in your alt text field. Describe what’s happening in additional images as needed. Remember that alt text isn’t just for the search engines! First and foremost, it’s for vision-impaired users, people with slow-loading browsers, and other people who can’t rely on the image itself to tell the story.&nbsp;<\/p>\n<p>Be sure to optimize your product images for fast-loading speeds to keep shoppers and search engines happy. Crop, resize and compress images to reduce file size of each image without compromising its quality.<\/p>\n<h3><strong>Product Headings<\/strong><\/h3>\n<p>A more technical product might necessitate a longer, more detailed description. Use content header tags (H1, H2, H3) to add structure for long-form product descriptions.<\/p>\n<p>These tags are visible on the description and will communicate what information is in each section of the text. The singular H1 header tag should be the most general tag on the page, then use subheadings to introduce more specific content about the product.<\/p>\n<p>For example, it’s usually appropriate to use the product name as the H1, but the H2s can include “Product Uses”, “Benefits”, “Features” or “Warranty Information”.<\/p>\n<p>Search engines will make a correlation between the header’s theme and text, allowing human visitors and search engines to more easily find the information they need.<\/p>\n<h3><strong>Product Reviews<\/strong><\/h3>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/57qRh40BUko_vkW_T4ZOYEOj746qq25sDLBGdYT7gqviIguO6aOuayuOx2yS5p9I0mcp7WbEZv4tiTEwh6fnmZcaPvlIuOshQH-_nuVdJ1jgZA2L-BmeUHNRoNVpZ3Ybi_74Y-cH\" alt=\"product page ratings SEO for ecommerce\"\/><\/figure>\n<p>Humans and search engines are similar in that they both seek assurance the product will do what it has promised. Most shopping cart software has built-in customer review tools that allow previous shoppers to leave a review and rating.<\/p>\n<p>If you read customer reviews before making a purchase online, you know how important it is to have credible product reviews. Not only do product reviews reinforce your product description accuracy; product star ratings can also appear on the search results and influence rank.<\/p>\n<p>Implementing a post-purchase product review campaign is a great way to connect with customers and build positive product reviews.<\/p>\n<h3><strong>Product Video<\/strong><\/h3>\n<p>While some customers prefer to look at images and read robust descriptions and customer reviews, other shoppers value video.<\/p>\n<p>Embedding a video on a product page is a great way to communicate product features, show a product unboxing or demonstrate how to service the product over time. Videos give each shopper confidence they will be satisfied with their purchase and are a great way to stand out from the competition.<\/p>\n<h2><strong>What To Do About Manufacturer-Provided Descriptions<\/strong><\/h2>\n<p>By now, we know product pages must include unique keywords and the page’s description needs to be conversion focused, but descriptions also need to be 100% unique to improve SEO.<\/p>\n<p>This means manufacturer-written product descriptions are not sufficient for maximum search visibility. While it’s tempting to use generic descriptions provided by vendors to save time,those product descriptions will not stand out versus the competition.<\/p>\n<p>For a properly optimized product page, we recommend you take the time to rewrite manufacturer descriptions and build an FAQ section that includes details about the product and why it should be purchased on your site.<\/p>\n<p>Search engines and humans crave unique content and information. Providing fresh and thorough product descriptions will help your site stand out to shoppers.<\/p>\n<p>Writing unique descriptions for your product pages may seem daunting but is worth the effort. Start writing descriptions for the top visited products or pages with the best margins first, then work through the remainder of the website pages.<\/p>\n<p>Bulleted product features, size charts or specs may be difficult to rewrite, so leave those technical items as-is. Instead, bolster the straightforward product features with unique content that’s truly beneficial to the shopper. Unique content is not only helpful to organic search performance but can also improve PPC and Shopping Ad performance.<\/p>\n<h2><strong>Examples of Properly Optimized Product Pages<\/strong><\/h2>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/7etRWWVqZdy_hCFBpm9-juEc0Ld5qzNOun5Fww-ZgR4lgT3fxfxZH0P55RK-QHbRgRLH78WDPf6iaoo9rO__RyAza3NiKcahqGzd3y-XCTW4n_QVUazQX9BJUM9HYESlxKx4EcEf\" alt=\"\"\/><\/figure>\n<p><strong>The Sausage Maker<\/strong> runs an ecommerce site selling DIY sausage equipment and prints catalogs for commercial accounts. This high-end <a href=\"https:\/\/www.sausagemaker.com\/digital-dry-curing-cabinet-p\/11-1509.htm\">dry curing cabinet<\/a> has a well-crafted URL, meta Title, meta description and a robust product description highlighting the benefits of the chamber and its features.<\/p>\n<p>The on-page description is longer than some ecommerce descriptions due to the list of features and higher price point. Charcuterie lovers can practically taste the delicious cured meats that can be enjoyed with the meat chamber.<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/0YRm0DoT6JLetMm_0xbo7j4DcjKmV-meWHNrcobKKw1EaYmMHdcK0FL3FFIxlN8YneZM8kReA3-h3Gqg2dcuseh7e0hGEuF9rQkpVZ39F_B6PJvuVWAtpht82lNZ5gGi1NvpLVGV\" alt=\"\"\/><\/figure>\n<p>The meta tags and product description include unique text and highlight the following keywords: “meat curing chamber”, “large-capacity digital dry aging cabinet”, “curing cabinet”.<\/p>\n<p>They also mention product attributes “stainless steel interior” and “anti-microbial membrane”. These phrases will allow the product to appear in related customer searches for digital dry curing equipment.<\/p>\n<p>This product page also includes a link to the instruction manual, 5-star product reviews, multiple high-quality images and a YouTube video embedded on the page.<\/p>\n<p>While the product is not available for online orders yet, the page includes a Wishlist button and steps to contact customer service for pre-orders.<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/CNYlTaJN5VaCjttDKR9hjyoUM8qjTCWMwtXw5aeQdwxjV1mL7M_aFq3eQv3xC7-EAIq4SoSItUNyRhcKjNNb6omzAxWVg3ugz_t0Yl6vNYTMhY4Him2teADCcgjdnWGcoKq-A1FQ\" alt=\"\"\/><\/figure>\n<p><strong>Manly Bands<\/strong> caters to men and women shopping for a memorable and unique wedding band not found at your local jeweler. The website allows customers to browse bands by style, material or collection, but their product pages are truly impressive. Here’s a link to the really, really, really ridiculously good-looking <a href=\"https:\/\/manlybands.com\/products\/blue-steel\">Blue Steel<\/a> ring.<\/p>\n<p>The creative product name is included in the product’s URL and Meta Title, but the company does a nice job of reinforcing the ring’s material and color details in the all-important Title tag. This allows Google to understand more about the band’s attributes and appeals to shoppers searching for tungsten blue inlay rings.<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/fmEt47Xynfupg_M-FGLnftTtdseO_ReTRZMFKQTOSqYQWIdKTgV2tDGbhF8i4UcYPW_WqJWEu1KoT323ZmHppOt8ax_KVeInKkTqDKtVpM1HJY5WI2ZL_2H1-EYPueUXMWrD-nVv\" alt=\"\"\/><\/figure>\n<p>The robust product page includes multiple high-resolution images of the band at several angles, positive customer reviews, a YouTube product unboxing, wedding band size guide and this entertaining quote that hilariously plays to the Blue Steel name:<\/p>\n<p><strong><em>BE THE BLUE STEEL <\/em><\/strong><em>Whether you are already a fashion icon or plan to be, remind yourself of your downright sexiness with this secretly blue wonder.<\/em><\/p>\n<h2><strong>Does Product SEO Change Depending on My Ecommerce Platform?<\/strong><\/h2>\n<p>Ecommerce SaaS platforms help level the playing field and allow entrepreneurs and businesses to design, build and manage stores even with limited technology experience.<\/p>\n<p>We hope you’re motivated to improve product page experiences to more effectively communicate to shoppers and search bots. No matter what a SaaS is selling you, there’s no single platform feature on Shopify, Magento, 3DCart, WooCommerce, etc. that supersedes the well-rounded product page optimization approach covered in this post.<\/p>\n<p>Prioritize unique and useful content that helps real-life customers. Frontload the description with the most important information as there’s no guarantee customers will read the entire page. The description must flow naturally with the rest of the page elements instilling confidence in the purchase.&nbsp;&nbsp;<\/p>\n<p>Good product page SEO is just as much about technical keyword targeting as it is about the psychology behind a user’s intent to purchase.<\/p>\n<p>Do you need help with your product page SEO? Get in touch with Studio today for a complimentary audit of your product-level SEO!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Want to bring more high-intent visitors directly to the products they’re looking for? Then it’s time to refresh your product page SEO.&nbsp;&#8230;<\/p>\n","protected":false},"author":4,"featured_media":7473,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[60],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Definitive Guide to Ecommerce Product SEO - Grow With Studio<\/title>\n<meta name=\"description\" content=\"A well-optimized product page won&#039;t just entice the search engines; it will convert your visits into sales. This guide will show you how.\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Definitive Guide to Ecommerce Product SEO - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"A well-optimized product page won&#039;t just entice the search engines; it will convert your visits into sales. This guide will show you how.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-01T21:30:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-21T14:46:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/10\/product-page-seo-e1603291577232.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1900\" \/>\n\t<meta property=\"og:image:height\" content=\"712\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"16 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/10\/product-page-seo-e1603291577232.jpg\",\"width\":1900,\"height\":712},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\",\"name\":\"The Definitive Guide to Ecommerce Product SEO - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#primaryimage\"},\"datePublished\":\"2020-10-01T21:30:48+00:00\",\"dateModified\":\"2020-10-21T14:46:30+00:00\",\"description\":\"A well-optimized product page won't just entice the search engines; it will convert your visits into sales. This guide will show you how.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo\",\"name\":\"The Definitive Guide to Ecommerce Product SEO\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\"},\"headline\":\"The Definitive Guide to Ecommerce Product SEO\",\"datePublished\":\"2020-10-01T21:30:48+00:00\",\"dateModified\":\"2020-10-21T14:46:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/ecommerce-product-page-seo#primaryimage\"},\"articleSection\":\"SEO\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/8b59d72adb219b6c89763938f642ff1d\",\"name\":\"Studio\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/10\/team3-96x96.jpg\",\"caption\":\"Studio\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7471"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7471"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7471\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7473"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}