{"id":7486,"date":"2020-10-05T10:16:44","date_gmt":"2020-10-05T15:16:44","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7486"},"modified":"2020-10-05T10:33:27","modified_gmt":"2020-10-05T15:33:27","slug":"2020-holiday-ecommerce-guide","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide","title":{"rendered":"Your 2020 Ecommerce Holiday Planning Guide"},"content":{"rendered":"\n<p>The 2020 holiday ecommerce season has some big shoes to fill. Last year’s Cyber Monday marked the <a href=\"https:\/\/www.cnbc.com\/2019\/12\/25\/reuters-america-corrected-record-online-sales-give-u-s-holiday-shopping-season-a-boost-report.html\">biggest online shopping day in U.S. history<\/a>, hitting record sales of over $3.4 billion. And as impressive as last year’s numbers are, this season’s holiday sales are expected to surpass them by a landslide: according to Statistica, online spending for the 2020 holiday season will generate <a href=\"https:\/\/www.statista.com\/topics\/1103\/holiday-season-e-commerce\/\">a predicted $134 billion in revenue<\/a>. <\/p>\n<p>Why such bold predictions? Ecommerce sales have already been on a steady incline over the past few years (a 20% increase in the 2019 holiday season compared to 2018, according to Statista). We were already expecting that trend to continue, and then COVID-19 went and threw gasoline on the fire. People have no <em>choice <\/em>but to shop online this year.&nbsp;<\/p>\n<p>Now mix in some market volatility, a contentious election season, postal system slowdowns, and a high likelihood of extreme weather&#8230;and we’re in for a bumpy ride this year, folks.&nbsp;<\/p>\n<p>That’s why we’ve spent the last couple months building a cache of holiday-related content on the Grow With Studio blog. Experts from each digital marketing team have pitched in with posts ranging from planning your holiday email campaign to dealing with USPS slowdowns. This guide will help you organize your calendar and point you to those resources, while providing its own set of tips and takeaways for each digital marketing strategy.&nbsp;<\/p>\n<p>We’re not going to beat around the bush here: this is a crazy time for all of us. That doesn’t mean your business has to take a hit. While there&#8217;s no telling what the next few months will bring, you can get yourself on track now and organize your 2020 holiday ecommerce planning. Come November, you’ll have the best possible chance to conquer the holidays this season!&nbsp;<\/p>\n<h2>2020 Holiday Resources&nbsp;<\/h2>\n<p>We’ll link to these posts again when we discuss their respective strategies, but why force you to dig? Here are all of our 2020 holiday resources at a glance:&nbsp;<\/p>\n<ul><li><strong>Shipping &amp; Logistics<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/usps-shipping-ecommerce\">What the USPS Shipping Delays Mean for Your Ecommerce Business<\/a><\/li><li><strong>Design<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/holiday-website-design-prep\">4 Easy Ways to Bring Some Holiday Cheer to Your Website Design<\/a><\/li><li><strong>Shopping Feeds<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/holiday-prep-google-shopping-campaign\">Planning Your Google Shopping Campaigns for the Holiday Season<\/a><\/li><li><strong>Social Media<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/social-media-marketing-checklist-for-the-holidays\">Social Media Marketing Checklist for the Holidays<\/a>&nbsp;<\/li><li><strong>Email Marketing<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/how-to-create-an-email-marketing-strategy-for-the-holidays\">How to Create an Email Marketing Strategy for the Holidays<\/a><\/li><li><strong>SEO<\/strong>: <a href=\"https:\/\/www.growwithstudio.com\/blog\/quick-guide-to-holiday-seo\">A Quick Guide to Holiday SEO<\/a><\/li><\/ul>\n<h2>Design for the Holidays<\/h2>\n<p><strong>Creating a new design or going responsive?<\/strong> Move that task off your plate ASAP and launch now, or table your launch until after the holiday season. A new launch during a high-traffic period for your store is a recipe for disaster. Note your store’s seasonal booms and busts, and plan full-scale redesigns for your slowest period. Your organic traffic might take a slight hit with the new design install while search engines re-crawl your site, so launching during your slow period gives you plenty of time to ramp back up for your busier seasons.&nbsp;<\/p>\n<p>Still itching for a design refresh before the holidays? No problem! There are plenty of changes you can make, from swapping out merchandising photos to making new hero graphics, that won’t cause a massive shakeup for your site. We share a few ideas here: <a href=\"https:\/\/www.growwithstudio.com\/blog\/holiday-website-design-prep\">4 Easy Ways to Bring Some Holiday Cheer to Your Website Design.&nbsp;<\/a><\/p>\n<p><strong>Promotions and Sales<\/strong>: <strong>If you haven’t done so already, <\/strong>map out the promotions or sales you want to run through the end of the year. If any promotions necessitate new graphics, get those finished ASAP so you don’t end up in a last-minute scramble. Front-load your work whenever you can.&nbsp;<\/p>\n<h2>PPC &amp; Paid Ads for the 2020 Holiday Season<\/h2>\n<p><strong>What to Prep:<\/strong> If you’re going to run paid search campaigns during the holidays, our PPC pros recommend starting your prep work <strong>early to mid September.&nbsp;<\/strong><\/p>\n<p>We know, we know — it’s October already. Don’t sweat it if you’re a couple weeks behind. If you bump the prep work to the top of your To-Do list and knock it out ASAP, you’ll still have plenty of time to explore your data and build out your campaigns. Campaign prep includes:<\/p>\n<ul><li>Auditing keyword lists<\/li><li>Identifying top performers<\/li><li>Segmenting campaigns<\/li><li>Creating new audience lists<\/li><\/ul>\n<p><strong>Holiday-Related Ads<\/strong>: If you’re running some holiday specials, you can get a few additional ducks in a row now:<\/p>\n<ul><li>Designing holiday sale- or gift-related landing pages&nbsp;<\/li><li>Writing new ad copy<\/li><li>Setting up promotions<\/li><li>Managing Promotion extensions<\/li><li>Creating and managing themed image ads<\/li><\/ul>\n<h3>Shopping Feeds for the Holidays<\/h3>\n<p><strong>New campaigns:<\/strong> The earlier you can start implementing your Google Shopping Feeds, the better — early implementation will let you troubleshoot any errors and get your feed in top shape before the holiday season.&nbsp;&nbsp;<\/p>\n<p><strong>Existing campaigns:<\/strong> If you have existing campaigns, it is a good idea to <strong>start prepping for the holiday season in October<\/strong>. You’ll have less prep work than you would if you were to start a new feed campaign from scratch, but don’t wait too long to make the adjustments you need for the holidays. Things move a bit slower in Q4 because there are more players on the field who need their feeds reviewed and sites indexed. That’s especially true this year!&nbsp;<\/p>\n<p><strong>What to Prep<\/strong><\/p>\n<p><strong>Start early to give yourself a buffer:<\/strong> Starting early on building and implementing your feed campaigns gives search engines the time they need to crawl and index your site after submitting your first data feed. Keep in mind, reviewing feeds and indexing sites can take longer in Q4 due to an increased number of sites getting on the platform.&nbsp;&nbsp;<\/p>\n<p><strong>Stock up on inventory<\/strong>: With more shoppers on the prowl for the best deals at the end of the year, make sure there’s enough stock in place to fill a higher volume of sales. <strong>Start stocking up now<\/strong> to ensure you have enough to fulfill holiday orders.&nbsp;<\/p>\n<p><strong>Check your data:<\/strong> Ensure you have high quality product data for new items you add to the site for the holidays:&nbsp;<\/p>\n<ul><li>High resolution photos<\/li><li>Descriptive product titles and descriptions<\/li><li>Check that your products and site all follow <a href=\"https:\/\/searchengineland.com\/you-cant-advertise-that-the-big-list-of-prohibited-ads-across-social-and-search-platforms-322222\">search engine rules for advertising<\/a><\/li><\/ul>\n<p><strong>Check your Competitor’s moves: <\/strong>Our Feeds experts recommend browsing sites that offer the same products or similar products and noting the deals your competition is offering. Then form your strategy, aiming to stay as competitive as possible. Running sales and offering things like discounted or free shipping can help your site stand out from the crowd when shoppers are comparing products.<\/p>\n<p><strong>Streamline your checkout process:<\/strong>&nbsp; Minimizing the number of clicks a user has to take from the product page to the order finished page should be a top priority for your site for the holidays (and year round!). <strong>Start removing any barriers to purchase in late October <\/strong>to allow visitors to get to that “Order Complete” page and put dollars in your account faster.&nbsp;<\/p>\n<p><strong>Looking for more Google Shopping tips<\/strong> for the holidays? Check out our blog post <a href=\"https:\/\/www.growwithstudio.com\/blog\/holiday-prep-google-shopping-campaign\">Planning Your Google Shopping Campaigns for the Holiday Season<\/a>.&nbsp;<\/p>\n<h2>Email Marketing for the 2020 Holiday Season<\/h2>\n<p><strong>For an in-depth look at email marketing for the holidays<\/strong>, read our post titled <a href=\"https:\/\/www.growwithstudio.com\/blog\/how-to-create-an-email-marketing-strategy-for-the-holidays\">How to Create an Email Marketing Strategy for the Holidays<\/a>.&nbsp;<\/p>\n<p><strong>Create Buzz:<\/strong> With email marketing, you can send out emails to your customer base ahead of any promotions and sales coming up to stir up excitement and make people aware of what you’re offering. To make your email marketing more scalable, <strong>create a few email templates ahead of time<\/strong> that you can use and reuse with new content each time you want to get the word out about a promotion. That way, you’ve done most of the legwork already, and you’ll just have to plug in the relevant content.&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n<h2>SEO for the Holidays<\/h2>\n<p>Bad news first (followed by good, we promise): If you’re trying to boost your site’s organic presence before the holidays ramp up, it’s best to get started mid-July or August. It takes time to build up enough content to get search engines to understand what makes your site relevant and different from the competition. If you weren’t working with any SEO strategy at all before now, you may not get new pages ranked for the holidays, depending on the competitiveness of your niche.&nbsp;<\/p>\n<p><strong>That said, there’s good news a-plenty.<\/strong> Let’s assume you’re <em>not <\/em>a brand new site and your pages have already been able to build some natural organic traction before now. Optimizing these pages might slightly improve your rankings for the holidays, and it will certainly improve the odds of getting a customer to convert. The beauty of SEO work is that we don’t just do it for the search engines; every on-page improvement we make also improves the customer experience. So don’t assume work started now won’t make a huge difference this holiday season; as long as it’s geared toward making life more useful for the customer, it will help your business.&nbsp;<\/p>\n<p>What’s more, sites with high authority who write about time-sensitive topics can benefit from Google’s “freshness algorithm,” or its tendency to prioritize new content over old for time-sensitive subject matter. So the search engine will naturally be hungry for your fresh Black Friday content over, say, a competitor’s Black Friday content from a year ago. You can produce content like this when the timing is appropriate and trust the search engine’s ability to find it.&nbsp;<\/p>\n<p><strong>On-page SEO To-Dos:<\/strong> We recommend performing the following on-page work for your site:&nbsp;<\/p>\n<ul><li>Research keywords to identify important terms to use in your content<\/li><li>Optimize URLs with keyword phrases, making sure they’re descriptive and user-friendly<\/li><li>Optimize meta titles and descriptions on every category page<\/li><li>Add descriptive alt text image tags on product pages<\/li><li><strong>Write optimized content, remembering that this is your time to really <\/strong><strong><em>sell <\/em><\/strong><strong>the product.<\/strong> Provide all the information your customer needs, making your differentiators and incentives clear. This is the sort of work that makes a difference above and beyond rankings, so take it seriously.&nbsp;<\/li><li>Double-check your product pages for usability, paying extra attention to page speed. Does the page load quickly? Are your images compressed? Can your server handle the amount of traffic you expect during the holidays, or is it time for an upgrade?&nbsp;<\/li><\/ul>\n<p><strong>Off-page SEO To-Dos:<\/strong> Using off-page SEO tactics, you can network with industry-related websites and incorporate social media to gain backlinks and turn your brand into an authority. <strong>S<\/strong><strong>tart gathering backlinks in October<\/strong>. Network with industry influencers online for product reviews, or offer to write guest blogs for popular bloggers or informational sites. See if you can get your products included in holiday gift guides and other promotional content.&nbsp;<\/p>\n<p>Additional off-page strategies can include <strong>being active on social media and developing email marketing campaigns in November and December to increase engagement<\/strong> with your brand. While these are year-round tasks, you can ramp up the efforts for them closer to the holidays for a bigger impact. Like your on-page SEO, your off-page SEO strategy isn’t just about rankings; it’s a crucial way to generate buzz and introduce new customers to your brand!&nbsp;<\/p>\n<p>For more SEO tips and tricks, check out <a href=\"https:\/\/www.growwithstudio.com\/blog\/quick-guide-to-holiday-seo\">A Quick Guide to Holiday SEO<\/a>.&nbsp;<\/p>\n<h2>Social Media for the Holidays<\/h2>\n<p><strong>Pinterest:<\/strong> It’s a great idea to <strong>create infographics on Pinterest with product collections for gift ideas (“gifts for her\/him\/kids\/etc”) during October<\/strong>. Holiday shoppers will thank you for helping make their gift-hunting just a bit easier! <strong>E<\/strong><strong>nable rich pins for Pinterest ASAP<\/strong> to provide visitors with a shoppable experience from your Pinterest page.&nbsp;&nbsp;<\/p>\n<p><strong>Facebook: <\/strong>Start planning your posts, sales and promotions now, and <strong>pre-schedule your coupons on Facebook before the end of October<\/strong>. You also can go ahead and <strong>enable Dynamic Ads on Facebook now<\/strong>. With Dynamic Ads, you’ll be able to retarget your web visitors with products they’ve searched for, viewed, or even added to their carts.&nbsp;<\/p>\n<p><strong>Instagram:<\/strong> <strong>Plan out your posts a week ahead of time<\/strong> for quick and easy posting. You can, of course, plan certain posts even earlier if you have fixed sale dates and know the exact messages you’re going to share for the different holidays. We recommend doing weekly planning anyway so you can stay on top of what’s happening <em>now <\/em>and respond with the most relevant content. Tools like <a href=\"https:\/\/www.planoly.com\/\">Planoly.com<\/a> and <a href=\"https:\/\/later.com\/\">Later.com<\/a> can help you keep things straight as you plan out your posts in advance.&nbsp;<\/p>\n<p><strong>Social Ads: <\/strong>For the big sale days like Black Friday and Cyber Monday, it’s best to place more general-purpose ads on your social channels at the <strong>beginning of October<\/strong> to build up the community around your brand. After a couple of weeks of running your ads, check the stats to see what is resonating with consumers and build on those points.&nbsp;<\/p>\n<p>Need more in-depth social media info and a checklist to help you keep everything straight? Head over to <a href=\"https:\/\/www.growwithstudio.com\/blog\/social-media-marketing-checklist-for-the-holidays\">Social Media Marketing Checklist for the Holidays<\/a>.&nbsp;<\/p>\n<h2>Handling the 2020 Holiday Craziness&nbsp;&nbsp;<\/h2>\n<p>A year ago, we’d never have guessed we’d be adding an extra section to our 2020 holiday marketing guide to discuss&#8230;you know&#8230;2020. But here we are! Here’s some extra information to help you stay sane and profitable in the upcoming months:&nbsp;&nbsp;&nbsp;<\/p>\n<h3>Postal Service Slowdowns and Other Shipping Delays&nbsp;<\/h3>\n<p>As people, we’re being hit by weirdness on multiple fronts. As a business, you have more of a point of focus because many different branches of weirdness convene on the same impact: shipping delays. USPS budget crisis? Shipping delays. More people getting sick? Shipping delays. More people shopping online? Shipping delays. Supply chain issues? Yep, you got it — shipping delays.&nbsp;<\/p>\n<p>To help you out, we wrote a guide called <a href=\"https:\/\/www.growwithstudio.com\/blog\/usps-shipping-ecommerce\">What the USPS Shipping Delays Mean for Your Ecommerce Business<\/a>. While the post covers the USPS slow-down specifically, it quickly moves into tips that will help you through any shipping situation regardless of what caused it. We taking the communication tips to heart, since full transparency and early communication will be your best weapons for the 2020 holiday season.&nbsp;<\/p>\n<h3>COVID-19 Resources&nbsp;<\/h3>\n<p>Wondering what COVID-19 holiday marketing will look like this year? Us too! While the tone may be more subdued and serious this holiday season, we’ve all been living in a post-COVID world for some time now and don’t expect businesses to hold back on the promotions and sales that keep them running. We’re well into embracing our new normal, and that means the holiday messaging you see this year may not vary wildly from other years. However, we do expect that family, gratitude, and empathy will be even stronger forces this year.&nbsp;<\/p>\n<p>Here are some resources to help you decide what and how to communicate to your customers:&nbsp;<\/p>\n<ul><li><a href=\"https:\/\/www.growwithstudio.com\/blog\/social-media-content-the-new-normal-and-how-to-avoid-burnout\">Social Media, the “New” Normal and How to Avoid Burnout<\/a><\/li><li><a href=\"https:\/\/www.growwithstudio.com\/blog\/customer-service-in-the-time-of-covid\">Customer Service in the Time of COVID: 5 Guiding Tips for Businesses<\/a><\/li><li><a href=\"https:\/\/www.growwithstudio.com\/blog\/8-things-your-business-can-do-covid-19\">8 Ways to Maintain Business as Usual During COVID-19<\/a><\/li><li><a href=\"https:\/\/www.growwithstudio.com\/blog\/covid-19-social-media-shift\">How COVID-19 Has Shifted the Social Media Landscape for Businesses<\/a><\/li><li><a href=\"https:\/\/www.growwithstudio.com\/blog\/revenue-generating-ideas-covid-19\">55 Revenue-Generating Ideas for Local Businesses During COVID-19<\/a><\/li><\/ul>\n<h3>A Pep Talk<\/h3>\n<p>2020 has been <em>hard<\/em>. If you’ve been personally impacted by COVID-19, racial injustice, social isolation, or economic hardship, our hearts go out to you. If you’ve had a tough time watching other people go through these things, honor that too. Then pat yourself on the back for having a full range of human feelings.&nbsp;&nbsp;<\/p>\n<p>The holidays are overwhelming no matter what. <strong>If this isn’t your year to throw the same blowout sale you usually throw, that’s okay.<\/strong> If you don’t want to spend Black Friday through Christmas working around the clock, don’t. Reign in some of your sales, or use the same promotions and materials for each holiday because <em>nobody will notice or care<\/em>. Instead of aiming to blow last year’s revenue out of the water, plan next year’s budget around the worst-case scenario and let your holiday revenue be a bonus.&nbsp;<\/p>\n<p><strong>And if you <\/strong><strong><em>do <\/em><\/strong><strong>want to blow last year’s numbers out of the water? Don’t let anyone tell you that you shouldn’t.<\/strong> Your business’s survival is important, too. Your desire to look out for it, as long as it’s not hurting anyone, is valid.&nbsp;&nbsp;<\/p>\n<p>Let yourself feel comfortable with your decisions, no matter what they are. We’ve all been through a lot this year, but we’re almost on the other side of it. Until then take care of yourself and your loved ones, and happy holidays!&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 2020 holiday ecommerce season has some big shoes to fill. Last year’s Cyber Monday marked the biggest online shopping day in&#8230;<\/p>\n","protected":false},"author":2,"featured_media":7487,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[81],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Your 2020 Ecommerce Holiday Planning Guide - Grow With Studio<\/title>\n<meta name=\"description\" content=\"Get your ecommerce ducks in a row this holiday season with tips from our SEO, paid media, social media, email marketing and design experts.\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Your 2020 Ecommerce Holiday Planning Guide - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Get your ecommerce ducks in a row this holiday season with tips from our SEO, paid media, social media, email marketing and design experts.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-05T15:16:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-05T15:33:27+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/10\/mel-poole-LUPXhXj2ip0-unsplash-scaled-e1601910680978.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"966\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"14 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/10\/mel-poole-LUPXhXj2ip0-unsplash-scaled-e1601910680978.jpg\",\"width\":2560,\"height\":966},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\",\"name\":\"Your 2020 Ecommerce Holiday Planning Guide - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#primaryimage\"},\"datePublished\":\"2020-10-05T15:16:44+00:00\",\"dateModified\":\"2020-10-05T15:33:27+00:00\",\"description\":\"Get your ecommerce ducks in a row this holiday season with tips from our SEO, paid media, social media, email marketing and design experts.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide\",\"name\":\"Your 2020 Ecommerce Holiday Planning Guide\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/3d85d64139f7c0de2a809a9c10d72456\"},\"headline\":\"Your 2020 Ecommerce Holiday Planning Guide\",\"datePublished\":\"2020-10-05T15:16:44+00:00\",\"dateModified\":\"2020-10-05T15:33:27+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/2020-holiday-ecommerce-guide#primaryimage\"},\"articleSection\":\"Ecommerce\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/3d85d64139f7c0de2a809a9c10d72456\",\"name\":\"Grow With Studio\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/10\/team3-96x96.jpg\",\"caption\":\"Grow With Studio\"},\"sameAs\":[\"https:\/\/www.growwithstudio.com\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7486"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7486"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7486\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7487"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7486"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7486"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7486"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}