{"id":7586,"date":"2020-12-10T12:10:10","date_gmt":"2020-12-10T18:10:10","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7586"},"modified":"2020-12-10T12:22:52","modified_gmt":"2020-12-10T18:22:52","slug":"marketing-for-niche-industries","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries","title":{"rendered":"Does Niche Industry Experience Matter In A Digital Marketing Agency?"},"content":{"rendered":"\n<p>If you work in an industry that requires highly specialized knowledge, you might find the idea of working with a digital marketing agency daunting. How will you get an outsider up to speed on regulatory quirks or technical information? How will a digital marketer communicate the benefits of your products to your customers if they’re not fluent in your industry’s language? Should you just hire an in-house marketer instead?&nbsp;<\/p>\n<p>Not so fast. The situation isn’t as black-or-white as you think, and — as we’ll see shortly — expert-level knowledge of your industry isn’t a requisite as long as your marketer has expert-level knowledge of their <em>own <\/em>industry. This post will demystify a common concern about working with digital marketing agencies when your products are niche or technical in nature.&nbsp;<\/p>\n<h2>Should You Work With An Agency or In-House Marketer?&nbsp;<\/h2>\n<p>Trick question! Most businesses use a blend of agency and in-house marketers, and there’s good reason to do so.&nbsp;<\/p>\n<p>In-house hires have the specialized insider knowledge you’re looking for; if they don’t, living and breathing your business for 40+ hours a week will have them up to speed in no time. Therein lies the benefit of in-house hires: they are 100% focused on <em>your <\/em>business. Your culture. The ins and outs of your products. They know that when they have questions, the right team member is just a Slack chat away. They know what the top customer concerns are, and they know how your sales team turns on-the-fence prospects into loyal customers. That’s huge! In-house hires develop a level of fluency with your products that an agency hire would not have the bandwidth to replicate without making a full-tilt career change into your industry.&nbsp;<\/p>\n<p>So why does anyone ever bother with agencies at all? Well, we’ve already established that it’s difficult to find people with specialized knowledge in paid media, SEO, or copywriting <em>and <\/em>in highly niche industries. The inverse is also true: you’re going to have a hard time staffing your business with people who know your industry but also have those highly specialized marketing skills. And at the end of the day, you need a digital marketing team with an extensive background in digital marketing. <\/p>\n<p>It’s also a lot more economical to work with agencies, despite the discrepancy you’re likely to find if you compare hourly rates. Here’s the thing: your agencies are working billable hours. Your employees, for the most part, are not. You’re paying a huge amount of overhead for your creative employees to put in 8+ hours of work per day for five days a week despite the human brain’s literal inability to actually perform that much creative work in a day. When it comes to creativity and problem-solving, our brains max out around four hours; according to Inc.com, the average employee actually puts in less than this, clocking around <a href=\"https:\/\/www.inc.com\/melanie-curtin\/in-an-8-hour-day-the-average-worker-is-productive-for-this-many-hours.html\">two hours of productive work per day<\/a>.&nbsp;<\/p>\n<p>You’re not working with machines, and businesses with a happy workplace culture understand that. So they spend a significant amount of overhead — about six hours per employee per day, if Inc.com is correct — letting employees recharge, zone out, participate in meetings that aren’t always productive, and otherwise have the space they need to think creatively. And that’s on top of sick days, vacation days, holidays, off days, team-building outings, and more. On top of <em>that<\/em>, in-house specialists also need equipment and specialized paid tools (for example: our SEO team at Grow With Studio uses about ten different paid tools regularly, and that’s a conservative guess).&nbsp;<\/p>\n<p>When you work with an agency, the extra amount you pay per hour pales in comparison to the amount you save when you <em>only pay for the time spent on productive work. <\/em>It’s <em>our <\/em>business’s job to foot the bill for the care and keeping of employees, not yours.&nbsp;<\/p>\n<h2>What To Look for In an Agency&nbsp;<\/h2>\n<p>Okay, you’re convinced: you’re going to find an agency partner to help you with your digital marketing strategy. How much experience <em>should <\/em>your prospective agency have with your industry?&nbsp;<\/p>\n<p>That’s a complicated question. Remember, we’re talking about highly specialized industries: think aviation aeroducts and other aviation parts, not general hardware. If you fall into the latter category, it’s safe to assume your prospective digital agency has worked with businesses like yours in the past. If you fall into the former category, finding an industry-experienced agency partner may be more of a roll of the dice (but don’t be surprised if your prospective agency does have that experience! If they’ve been around for ten years or more, they’ve probably seen it all).&nbsp;<\/p>\n<p>Instead of starting with your offering at the most specific level and working out, start with broad categories and work your way in. For our aviation parts example, that might look like:&nbsp;<\/p>\n<p>B2B &gt; Ecommerce &gt; Industrial &gt; Aviation Parts<\/p>\n<p>Or it might look like:&nbsp;<\/p>\n<p>B2C &gt; Ecommerce &gt; Hardware &gt; Aviation Parts; or B2C &gt; Ecommerce &gt; Hobbies &gt; Aviation&nbsp;<\/p>\n<p>Now you have control over setting the category level where experience is a must. It’s more than reasonable to expect your agency to have extensive experience with your two outer categories (ecommerce, B2B, B2C, etc), and you can also expect them to have worked successfully in the past with clients from your third-level category (industrial\/hobbies\/hardware\/etc). Just keep in mind that the deeper you’ve moved in your category levels, the less mandatory insider experience is. <\/p>\n<p>That said, there are a number of agencies that make one industry (legal, automotive, medical, etc) their bread and butter. It’s worth pursuing these options if you’re commissioning a highly technical ebook or want a PR representative with contacts at niche publications. If you’re looking for help with SEO, paid media, social media, web design, and (to a large extent) copywriting&#8230;the niche overlap is mostly a marketing ploy on the agency’s end. It gives them a differentiator and lets them target you in a more specific way (which isn’t wrong, by the way; that’s what you did when you picked a niche, too). Let the granular level of industry experience serve as a tie-breaker if you need one, but it’s not a selling point in itself. <\/p>\n<p>Your agency should be much more excited to tell you about their background in the field you need help with (SEO, PPC, etc) than to tell you about the number of lawyers they’ve worked with. In fact, that level of industry specialization can even be a red flag sometimes, because digital marketing itself is such a specialized field. Listen for specific, actionable marketing strategies, not vague or high-level promises. <\/p>\n<p>Finally, head over to your prospective agency’s case <a href=\"https:\/\/www.growwithstudio.com\/case-studies\">studies section<\/a> and read the ones for businesses that overlap with yours in 2-3 layers of business category. Pay attention to the agency&#8217;s approach with this client, including the specific tactics they used. If you want to know a secret, this part is more important than the numbers; it takes full context to understand the relative strength or weakness of results, but you’ll always be able to tell if the specific approach seems comprehensive and well-executed. Moreover, you can start thinking about whether a similar approach might be right for your business.   <\/p>\n<p>What’s that, you say? Your prospective agency doesn’t <em>have <\/em>any case studies? Maybe they list the logos of clients they’ve worked with, but you can’t click on them to learn more? That’s a sign that your “agency” is actually just a guy with a business license who invented an agency or consulting group out of thin air so he can call himself the CEO\/CMO. This is a common solution for people who aren&#8217;t qualified to get formally hired for the director-level position they think they deserve, and they won’t have the specialized marketing background to help you. Look for case studies. <\/p>\n<p>(Note: Don’t rule out freelancers who identify themselves properly! Do ask them for work samples, too).&nbsp;&nbsp;<\/p>\n<h2>Building Thought Leadership Within a Specialized Field&nbsp;<\/h2>\n<p>Once you’re working with your agency, you’ll notice that copywriting is the area where the lack of an industry background is most likely to cause friction. By extension, some parts of your SEO strategy might encounter the same issue. Writers are flexible, and it won’t be hard for a content strategist or copywriter to pick up your brand’s voice and key talking points. You may run into problems, however, if you need advanced-level content for industry thought leadership articles. <\/p>\n<p>Fortunately, this challenge is fully surmountable as long as you give your copywriter a little help. Common solutions include:&nbsp;<\/p>\n<ul><li>Let your writer interview in-house experts and write up the interview.&nbsp;&nbsp;<\/li><li>Have an in-house expert outline the article or draft information in bullet point form; your writer will be able to turn it into a narrative that flows.&nbsp;&nbsp;<\/li><li>Have an in-house expert edit the article so they can validate that all the right information was included and accurately conveyed.&nbsp;<\/li><\/ul>\n<p>Your writer will also, of course, do their own research so they can get an understanding of your industry, but remember how long it took <em>you <\/em>to develop your expertise and manage your expectations accordingly. As long as you don’t expect your writer to be the ultimate expert on your industry, you’ll be able to provide them with the resources you both need to run a successful strategy. If you <em>do <\/em>need someone with that level of expertise, hire a technical writer and pair them with your SEO specialist, who can leverage out of all that great content.&nbsp;<\/p>\n<p>The bottom line is, look for an agency that knows their respective marketing domain first and foremost. Marketers know how to do their research and tailor best practices for each business they work with. The rest will fall into place, leading to results that make <em>everyone <\/em>happy — especially your bottom line!&nbsp;&nbsp;&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you work in an industry that requires highly specialized knowledge, you might find the idea of working with a digital marketing&#8230;<\/p>\n","protected":false},"author":33,"featured_media":7587,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[219],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Does Niche Industry Experience Matter In A Digital Marketing Agency? - Grow With Studio<\/title>\n<meta name=\"description\" content=\"Worried that your niche or technical industry will make it impossible to contract out marketing work? Here&#039;s how to find the right fit.\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Does Niche Industry Experience Matter In A Digital Marketing Agency? - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Worried that your niche or technical industry will make it impossible to contract out marketing work? Here&#039;s how to find the right fit.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-10T18:10:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-10T18:22:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/12\/byron-sterk-jMpLgHLeXZQ-unsplash-scaled-e1607623800426.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"9 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/12\/byron-sterk-jMpLgHLeXZQ-unsplash-scaled-e1607623800426.jpg\",\"width\":2560,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\",\"name\":\"Does Niche Industry Experience Matter In A Digital Marketing Agency? - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#primaryimage\"},\"datePublished\":\"2020-12-10T18:10:10+00:00\",\"dateModified\":\"2020-12-10T18:22:52+00:00\",\"description\":\"Worried that your niche or technical industry will make it impossible to contract out marketing work? Here's how to find the right fit.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries\",\"name\":\"Does Niche Industry Experience Matter In A Digital Marketing Agency?\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\"},\"headline\":\"Does Niche Industry Experience Matter In A Digital Marketing Agency?\",\"datePublished\":\"2020-12-10T18:10:10+00:00\",\"dateModified\":\"2020-12-10T18:22:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/marketing-for-niche-industries#primaryimage\"},\"articleSection\":\"Business Strategy\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\",\"name\":\"Meg Nanson\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/02\/meg-nanson-96x96.jpg\",\"caption\":\"Meg Nanson\"},\"description\":\"Meg Nanson is Grow With Studio's Content Strategist and Wordsmith-at-Large. She comes fully-equipped with 8 years of experience in content strategy &amp; SEO, and has helped businesses of every size find their voice and scale their organic strategies.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7586"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7586"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7586\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7587"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7586"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7586"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7586"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}