{"id":7594,"date":"2020-12-22T16:14:44","date_gmt":"2020-12-22T22:14:44","guid":{"rendered":"https:\/\/www.growwithstudio.com\/?p=7594"},"modified":"2020-12-22T16:14:54","modified_gmt":"2020-12-22T22:14:54","slug":"abandoned-cart-solutions","status":"publish","type":"post","link":"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions","title":{"rendered":"How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems"},"content":{"rendered":"\n<p>Few things are more frustrating than pulling in healthy traffic and watching customers interact with your site, only to leave in the final moment. If you notice your customers are putting items in their cart and never returning, a few simple tweaks can return a whole lot of lost revenue. (One word of caution: <strong>do not<\/strong> make major design changes during your busy season! If you must make changes now, consider messaging adjustments, retargeting, follow-up emails, and other strategies that won’t potentially break site functionality). <\/p>\n<p>Barring any urgent issues, use this holiday shopping season to simply track your abandoned cart rate and analyze the results with the rest of your “post mortem” data in January. If you notice anything alarming or believe you can optimize your checkout process further, follow the tips below and start saving sales.<\/p>\n<h2><strong>What is Shopping Cart Abandonment?<\/strong><\/h2>\n<p>Shopping cart abandonment is exactly what it sounds like: a customer finds your store, moves through your sales funnel, adds your products to their cart, and then&#8230;leaves and never returns. It’s a major issue for ecommerce businesses of every kind; industry-wide, the average abandoned cart rate is <a href=\"https:\/\/www.statista.com\/statistics\/457078\/category-cart-abandonment-rate-worldwide\/\">88% as of March 2020<\/a>. That amounts to <a href=\"https:\/\/www.forrester.com\/report\/Understanding+Shopping+Cart+Abandonment\/-\/E-RES56827\">$18 billion in lost revenue per year<\/a>, according to Forrester Research. And that’s just the impact on direct revenue — search engine rankings are also at stake for some businesses, depending on the cause of the issue. <\/p>\n<p>Does an average abandoned cart rate of 88% sound unbelievable? It both is and isn’t. Few people would guess such a high number, to be sure. But think about how you shop, and the buying psychology might become more clear. Many people use their carts as a holding place for items that pique their interest as they explore, similar to a wish list. When it’s time to pull the trigger and check out, they may suddenly decide they don’t need the products <em>that <\/em>much, having never been very intent-driven in the first place. It’s the window shopping of the online world.&nbsp;<\/p>\n<p>That said, there are many reasons people abandon carts that have nothing to do with “normal” buying psychology. These issues are preventable and fixable, so they’re the ones we’ll be tackling in our how-to.&nbsp;<\/p>\n<h3><strong>Calculating Your Site’s Abandoned Cart Rate&nbsp;<\/strong><\/h3>\n<p>First, we’re going to remind you that Google Analytics tracks this information, and using this or another analytics dashboard is the only scalable way to approach your website data. But in the spirit of being thorough, we’ll show you how to calculate your abandoned cart rate manually (just in case you’re&#8230;on a plane without internet, or&#8230;.bored, or something). Here’s how it works:&nbsp;<\/p>\n<p>1 &#8211; (Number of completed purchases \/ number of shopping carts created) * 100 = your abandoned cart rate.&nbsp;<\/p>\n<p>For example, if 100 carts are created and 30 people go through with the purchase, your rate is:&nbsp;<\/p>\n<p>1 &#8211; (30\/100) * 100 = 70%.&nbsp;<\/p>\n<p>Again, it’s hard to fathom <em>why <\/em>you would need to calculate this if your data capabilities are such that you know how many carts have been created on your site. Hey, knowledge is power.&nbsp;&nbsp;<\/p>\n<h3><strong>What Is a Good Abandoned Cart Rate?&nbsp;<\/strong><\/h3>\n<p>&nbsp;It’s hard to talk universals in the ecommerce world due to variation across audiences and price points, but we do have some averages. Remember, the average abandoned cart rate across all industries is 88%. Here’s how that breaks down by industry:&nbsp;<\/p>\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/sCPYE357ZIpPkC9tDr4Kro8bBvfpungXK6iUoR4IhlWU8J8I8w1VfXBCP6NtcyASndy5lqUz1jNSuAhBtUaZqdyPpBWqmJ8jtWPrk7ZQrLYi2RkaHl9w9ZOFFN0CIg\" alt=\"\"\/><\/figure>\n<p>Also remember a rule of thumb: <a href=\"https:\/\/www.forbes.com\/sites\/paultalbot\/2018\/06\/27\/why-cart-abandonment-rates-arent-falling\/?sh=250c1ed37bb6\">the smaller the device, the higher the abandoned cart rate<\/a>.&nbsp;<\/p>\n<p>That said, every website is different. Anything above average should set your spidey senses tingling, but only you will be able to contextualize the risk. Track your abandoned cart rate over time and strive to maintain or improve it, even as your audience grows larger and more mobile.&nbsp;&nbsp;<\/p>\n<h2><strong>Why Do Customers Abandon Their Carts?<\/strong><\/h2>\n<p>Outside of normal shopping behavior, what correctable issues cause customers to abandon their cart? We’ll give you a run-down here and tackle solutions in the next section.&nbsp;<\/p>\n<ul><li><strong>Mandatory Account Creation: <\/strong>For frequent customers, user accounts are a great way to streamline the checkout process and personalize each customer’s experience. For new customers, they’re a headache. Imagine walking into a pet store for a one-off item and being forced to fill out a form with all your information before you can leave with your item (this is why most cashiers will let a “No” suffice when they ask if you’re a member of the store’s rewards program). If you’re in a physical store, you might feel obligated to fill out the form or you might just leave without making your purchase, depending on how badly you need that cat food. If you’re on a website, the decision to leave is easy and free from repercussions or social obligations. Optional account creation at checkout is a great idea; mandatory account creation, not so much.&nbsp;<\/li><\/ul>\n<ul><li><strong>Hidden and\/or High Shipping Costs: <\/strong>Cost-conscious customers often keep a tally as they shop, at least on a loose level, so they can stay under whatever mental budget they’ve set for their purchase. Hitting them with hidden fees or unexpectedly high shipping costs at checkout isn’t just a neutral inconvenience; for the customer, it’s a bait-and-switch. At <em>best<\/em>, they’ll grit their teeth and grudgingly make the purchase, which is hardly a recipe for a happy, loyal customer. At worst, they’ll resent your brand for wasting their time and become a detractor. Most commonly, they’ll fall somewhere in-between on the emotional spectrum and won’t make the purchase.&nbsp;<\/li><\/ul>\n<ul><li><strong>Long\/ Complicated Checkout Process: <\/strong>If you’re noticing a theme here, that’s no accident: customers hate taking more steps than necessary. If they’re clicking through more than one or two pages to check out, don’t expect them to get to the final page.&nbsp;<\/li><\/ul>\n<p>For the sake of efficiency, let’s lump usability issues into this category too. If your checkout process is slow, broken, or not mobile optimized, stop reading this post (bookmark it!) and go fix that.&nbsp;<\/p>\n<ul><li><strong>Lack of Payment Options\/ Installment Payment Plan Options: <\/strong>If you’re missing a common payment option like AmericanExpress, Paypal, or Apple Pay and that happens to be the option your customer wants\/needs to use, then (as my great aunt Mary says) that’s all she wrote&nbsp;<\/li><\/ul>\n<p>Financing options like Affirm let customers break up their payment into installments, which are usually interest-free for a significant period of time. Options like these are an extra incentive, but lacking them isn’t <em>always <\/em>a barrier. It all depends on how pricey your products are and what your competitors offer.&nbsp;<\/p>\n<ul><li><strong>Long Delivery Times: <\/strong>Again, this one’s relative to what people expect from your industry and what your competitors offer. Just don’t expect people to wait six weeks for their generic t-shirt to arrive from Hong Kong.&nbsp;<\/li><\/ul>\n<ul><li><strong>Undesirable Return Policy: <\/strong>Flexible return policies are a trust signal, and lacking a transparent one is a barrier. Some customers want to know about your return policy for practical reasons. For others, your return policy helps reinforce the quality of your brand’s customer service and its belief in its products. Either way, rigid return policies aren’t ideal outside of the obvious exceptions (food, healthcare products, 23&amp;Me tests, etc).&nbsp;<\/li><\/ul>\n<ul><li><strong>Unable to Find Promo\/ Discount Code: <\/strong>Sales and promotions are a double-edged sword. On the one hand, they’re practically guaranteed to spike your revenue during the promotion. On the other, customers quickly cotton on to the fact that the next great sale is just around the bend. If they’ve grown accustomed to using promo codes to score great deals on your site (or the websites of your close competitors), they might not be willing to check out without one.&nbsp;<\/li><\/ul>\n<ul><li><strong>Researching Buying Options: <\/strong>Sure, you have what the customer wants — but is it <em>really <\/em>the best value? If your differentiator isn’t so crystal clear that your value is inarguable, expect your customers to bounce around and comparison shop before committing to anything.&nbsp;<\/li><\/ul>\n<h2><strong>How To Recover Lost Sales from Abandoned Carts&nbsp;<\/strong><\/h2>\n<p>Now for the moment we’ve all been waiting for: how can we turn those tragically abandoned carts into a delicious pool of milk and honey (aka revenue)? Below, we’ll repeat each problem from before and walk you through the solution.&nbsp;<\/p>\n<p><strong>The Problem: Mandatory Account Creation<\/strong><\/p>\n<p><strong>The Solution: Enable Guest Checkout&nbsp;<\/strong><\/p>\n<p>Guest checkout can help new or impulse shoppers complete their purchase. Instead of asking your customers to create an account, offer them choices: log in, create an account, or check out as a guest. If they choose to check out as a guest, after they enter all their information give them the <strong>option <\/strong>of creating an account and saving their information for next time. That can be an easier ask because of the amount of information the customer has already entered. Above all, however, optional is the name of the game.&nbsp;<\/p>\n<p>Worried about the missed opportunity to hold onto your customer? Don’t. Incentivize email sign-ups and send a follow-up email to make sure the customer is satisfied, then focus on creating the best customer experience you can. Consistently positive experiences create a sustainable, loyal base over the long term.&nbsp;<\/p>\n<p><strong>The Problem: Hidden and\/or High Shipping Costs<\/strong><\/p>\n<p><strong>The Solution: Be Transparent&nbsp;<\/strong><\/p>\n<p>Be transparent about shipping costs and other fees as early as possible, and make sure the information is as visible as possible. FAQ pages are great for this, and you can link to them directly from each product page in addition to including them in the main menu or footer. Make sure this page includes everything you want to be transparent about: shipping times, return policies, fees, and more. If you do charge a fee beyond shipping, explain why.&nbsp;<\/p>\n<p>In some instances, you’ll want the information even more prominent — take advantage of the ever-useful sticky header to communicate more timely messages. This may include holiday shipping windows like “Last day to receive purchase by X Date,” or it could be used to communicate known weather\/COVID-related shipping delays.&nbsp;<\/p>\n<p>Consider absorbing shipping costs into your product prices so you can offer free shipping, or free shipping above a certain dollar amount. That’s the easiest way to make sure your customer won’t be surprised by their total in the end. As a bonus, creating price wall incentives can raise the average order value on your site.&nbsp;<\/p>\n<p><strong>The Problem: Long\/ Complicated Checkout Process&nbsp;<\/strong><\/p>\n<p><strong>The Solution:&nbsp;<\/strong><\/p>\n<p>Audit your checkout process and look for opportunities to reduce complication, starting with two fundamental rules: no more steps than necessary, and no more information requested than necessary. Make sure your checkout is optimized for mobile and works well on every browser (pop into Google Analytics and view your audience by browser and device. If you spot an anomaly like one browser’s visitors bouncing at an astronomically high rate compared to the others, you know what to work on next). Test the page speed of your checkout pages specifically and optimize if needed.&nbsp;<\/p>\n<p>Next, consider adding progress indicators to your checkout process. This can reassure customers that they only have a few steps to go. If you’ve ever landed on a clickbait article that forces you to click through 20 tedious slideshow pages when you just wanted to skim an article about celebrities and their historical doppelgangers, then you’ll understand why some customers feel trepidation after a couple of clicks if there’s no progress bar. There’s simply no telling <em>what <\/em>they’ve gotten themselves into.&nbsp;<\/p>\n<p><strong>The Problem: Lack of Payment Options\/ Installment Payment Plan Options<\/strong><\/p>\n<p><strong>The Solution: Let Your Competition Set The Bar, Then Beat It&nbsp;<\/strong><\/p>\n<p>Walk through the checkout process of competing sites and note every payment option offered (then seek penance from the karma gods, on account of that stream of abandoned carts you left in your wake). Try to provide at least everything your competition offers, on top of easy payment options like Paypal, Stripe, Google Wallet, and Apple Pay. Those easy payment options are another way to streamline the checkout process, since all of the customer’s necessary information is available through their provider.&nbsp;<\/p>\n<p>Additionally, notice if your competition offers financing or payment plans. Stay in step here too. If you sell at a higher price point, consider offering these options even if your competition doesn’t.&nbsp;<\/p>\n<p><strong>The Problem: Long Delivery Times<\/strong><\/p>\n<p><strong>The Solution: Be Reasonable and Strategic<\/strong><\/p>\n<p>To a certain extent, long delivery times can’t be helped. They can’t be helped, that is, unless you’re scrimping on every penny and choose the cheapest, slowest option. Be reasonable and find a good balance between fast shipping and prices that aren’t sky-high, and look into setting up a business account with your provider of choice so you get a discount. Shipping solutions like Shippo can also offer discounts, to some extent.&nbsp;<\/p>\n<p>If you’re shipping items from abroad to a U.S.-based audience, you’ll have to think about that model over the long term. For very niche or boutique items like handcrafted, made-to-order products, your customers will be on board with the wait because the extra shipping time is part of the trade they made to end up with an item they can’t find anywhere else.&nbsp;<\/p>\n<p>For generic products, your customer has no incentive to wait that long. You know those people who sell “Get rich with dropshipping” courses who tell you to sell AliExpress products through your website and wait for the passive income to roll in? None of them would be selling classes if they actually got rich through dropshipping. Nobody wants to wait four weeks for their dime store crap to arrive unless they bought it from Wish for 99 cents. Think strategically and choose a model that works.&nbsp;<\/p>\n<p><strong>The Problem: Undesirable Return Policy<\/strong><\/p>\n<p><strong>The Solution: Keep In Line With the Standard for Your Industry&nbsp;<\/strong><\/p>\n<p>Like many things on this list, there’s no universal with return policies; it’s relative to your industry. Once again, scout out your competition and aim to keep in step with or beat their policies. Then (yep, you guessed it) be transparent and make your policy clear and accessible.&nbsp;<\/p>\n<p><strong>The Problem: Unable to Find Promo\/ Discount Code<\/strong><\/p>\n<p><strong>The Solution: Install an Exit Intent Pop-Up&nbsp;<\/strong><\/p>\n<p>Triggered by actions like abruptly moving a cursor up to the right corner, exit intent pop-ups re-engage with customers just before they leave your website. This is your last chance (for now) to make your case, and it’s a great time to offer a promo code. Example: “Wait, don’t go! Use promo code 15OFF and have 15% off, on us.” The discount can be an extra incentive for people on the fence, and they can save the sale for people who were really hoping for a deal.&nbsp;<\/p>\n<p><strong>The Problem: Researching Buying Options&nbsp;<\/strong><\/p>\n<p><strong>The Solution: Email Marketing and Retargeting&nbsp;<\/strong><\/p>\n<p>If you’re active with email marketing, abandoned cart emails are a no-brainer. These gentle nudges remind customers about items they left in their cart and often add a promo code to close the deal. You can segment this audience still further into first-time and returning customers, as first-time customers might need a bigger push.&nbsp;<\/p>\n<p>Similarly, use retargeting to remind customers about products they loved and keep your brand fresh in their mind as they use their preferred platforms.&nbsp;<\/p>\n<p><strong>Bonus Solution: Social Proof&nbsp;<\/strong><\/p>\n<p>For customers who don’t know your brand, social proof is a big deal. Honest verified reviews can help instill trust in your products and steer your customers to the best solution for them. Solicit positive reviews to cement trust and make it more difficult for a single negative review to shake your reputation. If you have a social feed connected to certain products, incorporate user-generated content to show how happy customers are working the product into their lives.<\/p>\n<p>We hope this blog post finds you happy and healthy. May you and your ecommerce store enjoy a busy, fruitful holiday season!&nbsp;&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Few things are more frustrating than pulling in healthy traffic and watching customers interact with your site, only to leave in the&#8230;<\/p>\n","protected":false},"author":33,"featured_media":7595,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[83],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems - Grow With Studio<\/title>\n<link rel=\"canonical\" href=\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems - Grow With Studio\" \/>\n<meta property=\"og:description\" content=\"Few things are more frustrating than pulling in healthy traffic and watching customers interact with your site, only to leave in the...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\" \/>\n<meta property=\"og:site_name\" content=\"Grow With Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/growwithstudio\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-22T22:14:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-22T22:14:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/12\/markus-spiske-wL7pwimB78Q-unsplash-scaled-e1608674751261.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"14 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\",\"name\":\"Grow With Studio\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/growwithstudio\",\"https:\/\/www.instagram.com\/growwithstudio\/\",\"https:\/\/www.linkedin.com\/company\/growwithstudio\/\",\"https:\/\/www.pinterest.com\/GROWWITHSTUDIO\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2019\/06\/1.jpg\",\"width\":648,\"height\":428,\"caption\":\"Grow With Studio\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.growwithstudio.com\/#website\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Grow With Studio\",\"description\":\"We grow ecommerce.\",\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.growwithstudio.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/12\/markus-spiske-wL7pwimB78Q-unsplash-scaled-e1608674751261.jpg\",\"width\":2560,\"height\":960},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#webpage\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\",\"name\":\"How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems - Grow With Studio\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#primaryimage\"},\"datePublished\":\"2020-12-22T22:14:44+00:00\",\"dateModified\":\"2020-12-22T22:14:54+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/\",\"url\":\"https:\/\/www.growwithstudio.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\",\"url\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions\",\"name\":\"How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems\"}}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#webpage\"},\"author\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\"},\"headline\":\"How To Beat Abandoned Carts for Good: 9 Solutions To Common Problems\",\"datePublished\":\"2020-12-22T22:14:44+00:00\",\"dateModified\":\"2020-12-22T22:14:54+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#webpage\"},\"publisher\":{\"@id\":\"https:\/\/www.growwithstudio.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.growwithstudio.com\/blog\/abandoned-cart-solutions#primaryimage\"},\"articleSection\":\"Design\",\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.growwithstudio.com\/#\/schema\/person\/b25f7ff0d4ee787d5964bc7ea1e5ab20\",\"name\":\"Meg Nanson\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.growwithstudio.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.growwithstudio.com\/wp-content\/uploads\/2020\/02\/meg-nanson-96x96.jpg\",\"caption\":\"Meg Nanson\"},\"description\":\"Meg Nanson is Grow With Studio's Content Strategist and Wordsmith-at-Large. She comes fully-equipped with 8 years of experience in content strategy &amp; SEO, and has helped businesses of every size find their voice and scale their organic strategies.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7594"}],"collection":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/comments?post=7594"}],"version-history":[{"count":0,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/posts\/7594\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media\/7595"}],"wp:attachment":[{"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/media?parent=7594"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/categories?post=7594"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.growwithstudio.com\/wp-json\/wp\/v2\/tags?post=7594"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}